{
  "title": "Aloe On-Chain Reputation System",
  "url": "https://devpost.com/software/aloe-on-chain-reputation-system",
  "description": "Devpost",
  "technologies": [
    "blockchain",
    "css",
    "figma",
    "flask",
    "node.js",
    "python",
    "react",
    "solidity"
  ],
  "team_members": [],
  "awards": [
    "Winner"
  ],
  "images": [
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/389/481/datas/gallery.jpg",
      "alt": "Aloe On-Chain Reputation System – screenshot 1"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/389/478/datas/gallery.jpg",
      "alt": "Aloe On-Chain Reputation System – screenshot 2"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/389/480/datas/gallery.jpg",
      "alt": "Aloe On-Chain Reputation System – screenshot 3"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/389/479/datas/gallery.jpg",
      "alt": "Aloe On-Chain Reputation System – screenshot 4"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/challenge_thumbnails/002/355/961/datas/medium.png",
      "alt": "image"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/002/393/564/datas/profile.jpeg",
      "alt": "Candice Huang"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/000/619/734/datas/profile.jpeg",
      "alt": "Xiang Cui"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/47255508?height=180&v=4&width=180",
      "alt": "amit0365"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/47255508?type=square&v=4",
      "alt": "amit0365"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/002/393/564/datas/medium.jpeg",
      "alt": "Candice Huang"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/000/619/734/datas/medium.jpeg",
      "alt": "Xiang Cui"
    },
    {
      "src": "https://hacknyu-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/002/393/564/datas/profile.jpeg",
      "alt": "Candice Huang"
    }
  ],
  "links": [
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/389/481/datas/original.png"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/389/478/datas/original.png"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/389/480/datas/original.png"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/389/479/datas/original.png"
    },
    {
      "text": "aloe-hack-nyu-2023.web.app",
      "url": "https://aloe-hack-nyu-2023.web.app/"
    },
    {
      "text": "github.com",
      "url": "https://github.com/JeffCX/hacknyu-2023-aloe"
    },
    {
      "text": "www.figma.com",
      "url": "https://www.figma.com/file/wtUgZe7DVzXcLB4sDsUJAC/HackNYU-2023?node-id=0%3A1&t=rZJrppbdChX7QzHJ-0"
    },
    {
      "text": "github.com",
      "url": "https://github.com/JeffCX/hacknyu-2023-aloe-backend"
    },
    {
      "text": "goerli.etherscan.io",
      "url": "https://goerli.etherscan.io/address/0x49c7323d0ee80478e78c20e147865f5a36cea070"
    },
    {
      "text": "Twitter",
      "url": "https://twitter.com/devpost"
    },
    {
      "text": "Discord",
      "url": "https://discord.com/invite/HP4BhW3hnp"
    },
    {
      "text": "Facebook",
      "url": "https://www.facebook.com/devposthacks"
    },
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/company/devpost/"
    }
  ],
  "full_content": "Aloe On-Chain Reputation System | Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up Aloe On-Chain Reputation System Check, it Aloe's reputation system for sustainabilityOn-chain recognition for eco-abilityGet recognized for your efforts, stand out in the crowdBuy eco-friendly products make Mama Earth proud Like 3 Comment Story Updates Inspiration: The inspiration for our project stems from the growing concern around the environmental impact of blockchain technology. Energy consumption in the blockchain space has become a major issue, with the Bitcoin network alone consuming as much energy as an entire country. We are committed to addressing this issue by incentivizing sustainable practices through our on-chain reputation system, creating a more sustainable future for all. What it does: Aloe is an on-chain reputation system that aims to encourage sustainability by enabling individuals and businesses to showcase their commitment to sustainable practices and be recognized for their efforts. The system works by capturing receipts from stores and extracting the company's name from the receipt. It then searches for the sustainability score of the company and rewards the user with ALOE tokens based on the sustainability score in the receipt. The ALOE tokens can be used to redeem sustainable products or services, such as organic food, eco-friendly clothing, or electric vehicle charging stations. This creates an ecosystem that incentivizes the use of sustainable products and encourages businesses to adopt sustainable practices. Additionally, ALOE tokens can also be traded on exchanges, allowing users to profit from their sustainability efforts. As the demand for sustainable products and services grows, the value of the ALOE token can increase, providing economic gain to the holders. Aloe's ultimate goal is to bring real economic gain to ALOE holders and promote a more sustainable future. This can be achieved through collaborations with sustainable businesses, increasing the utility of ALOE tokens, and promoting the adoption of sustainable practices. How we built it: Our project began with a comprehensive UX process, starting with secondary research that included a competitive analysis. We then ideated by creating user stories and user flows, followed by designing the project through sketches, low fidelity prototypes, and high fidelity prototypes. We built Aloe using blockchain technology. We used smart contracts to create the ALOE token and the reputation system. We also used computer vision to recognize and extract the company's name and sustainability score from the receipt. Challenges we ran into: One of the main challenges we faced was the short time of the hackathon, which required us to brainstorm and collaborate in parallel. We also faced heavily dependency issues when trying to run the code on a teammate's computer. Accomplishments that we're proud of: Despite facing challenges, we are proud of our commitment to a thorough UX process that prioritizes creating an efficient and user-friendly platform. As a result, we have successfully developed multiple functional features, including the ability to check token balance, mint tokens, and generate detailed sustainability reports. These accomplishments showcase our dedication to creating a platform that not only promotes sustainable practices but is also easy to use for all users. What we learned: Through our project, we learned how to use blockchain technology to create a decentralized system that can benefit both individuals and businesses. We also learned how to use computer vision to extract information from receipts. Even more, we discovered that fostering a collaborative environment and encouraging open communication were crucial to our success. Regular brainstorming sessions allowed us to generate creative solutions and refine our ideas, while also identifying potential roadblocks and developing effective strategies to overcome them. Finally, we found that enjoying the process and having fun was essential to our motivation and overall success. By creating a positive and supportive team culture, we were able to stay engaged and enthusiastic throughout the project. What's next for Aloe On-chain Reputation System: We plan to optimize the leaderboard report and find more companies to collaborate with so that the ALOE token has more utility. We also plan to issue NFTs and bring real economic gain for ALOE holders. Additionally, we want to expand the system to include other areas of sustainability, such as energy usage and waste reduction. One way to bring real economic gain for ALOE holders is to increase the utility of the ALOE token. This can be done by forming partnerships with businesses that are committed to sustainability, and creating incentives for those businesses to accept ALOE tokens as payment for their products or services. ALOE holders could then use their tokens to purchase sustainable and eco-friendly products from these businesses, creating a closed-loop ecosystem that rewards sustainable practices and promotes a greener future. Another way to bring economic gain is to issue NFTs that are linked to sustainability efforts. These NFTs could represent a particular milestone in sustainability, such as reducing a certain amount of carbon emissions, and could be sold or traded on a marketplace. A portion of the profits from the sale of these NFTs could be used to buy back and burn ALOE tokens, increasing the scarcity and value of the remaining tokens. Overall, by creating a strong ecosystem that rewards sustainability and promotes the use of eco-friendly products, the ALOE token can become a valuable asset that provides real economic gain for its holders. Built With blockchaincssfigmaflasknode.jspythonreactsolidity Try it out aloe-hack-nyu-2023.web.app github.com www.figma.com github.com goerli.etherscan.io Submitted to HackNYU 2023 Winner Track: Sustainability Created by Candice Huang Xiang Cui amit0365 Like 3 3 people like this: Share this project: Updates Candice Huang started this project — Feb 19, 2023 06:54 AM EST Leave feedback in the comments! Log in or sign up for Devpost to join the conversation. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service"
}