{
  "title": "Dynamic Vector Based Spotify Recommendation Engine",
  "url": "https://devpost.com/software/dynamic-vector-based-spotify-recommendation-engine",
  "description": "Devpost",
  "technologies": [
    "css",
    "flask",
    "html",
    "huggingface",
    "javascript",
    "musixmatch",
    "oauth",
    "pinecone",
    "python",
    "spotifyapi"
  ],
  "team_members": [],
  "awards": [
    "Winner"
  ],
  "images": [
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://hackru-spring-2024.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/challenge_thumbnails/002/811/034/datas/medium.jpeg",
      "alt": "image"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/86940601?height=180&v=4&width=180",
      "alt": "Satvik Srinivas"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/ACg8ocIO1TDB-5T2rUn-a8X3zV2UHOXOBd0Y-ME3U0ydtQ2-XNk=s96-c?height=180&width=180",
      "alt": "Arun Avasi"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/97064879?height=180&v=4&width=180",
      "alt": "Varun Gangavarapu"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/97064879?type=square&v=4",
      "alt": "Varun Gangavarapu"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/86940601?height=180&v=4&width=180",
      "alt": "Satvik Srinivas"
    }
  ],
  "links": [
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "github.com",
      "url": "https://github.com/Varun-Gangavarapu/VectorDatabaseMoodAnalysis"
    },
    {
      "text": "Twitter",
      "url": "https://twitter.com/devpost"
    },
    {
      "text": "Discord",
      "url": "https://discord.com/invite/HP4BhW3hnp"
    },
    {
      "text": "Facebook",
      "url": "https://www.facebook.com/devposthacks"
    },
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/company/devpost/"
    }
  ],
  "full_content": "Dynamic Vector Based Spotify Recommendation Engine | Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up Dynamic Vector Based Spotify Recommendation Engine Rethink the way you listen to music. Like 1 Comment Story Updates Inspiration Last year with the emergence of LLM we got interested in Vector Databases and since then we have wanted to build one but it seemed to be a daunting task. One of our other members was working on another project concerning wave processing and we had the idea to create a music recommendation app. Since vector databases can theoretically be used for recommendation we decided to dive in and build this project. What it does It looks at the users recently played songs and then classifies them into a mood. It then gives the user recommendations on songs that are similar to that mood How we built it We used the Spotify API to get information about a song such as the isrc. Then we used the src with the MusixMatch API to get the lyrics. We ran sentiment analysis using a HuggingFace model on the lyrics of songs to get 6 basic emotions. From there we created 21 new emotions using linear combinations of our basic 6 and classified each song into these emotions. We represented these emotions as a vector in a vector database. Using an algorithm called KNN based on pair wise cosign similarity calculations we were able to find vectors with similar sentiments. Challenges we ran into Most of our challenges came from conceptualizing and understanding the theory behind vector databases. However by far the most frustrating part was dealing with the APIs. Their documentation was completely lacking and their errors were nondescript. Finding workarounds for these issues was where a lot of difficulty arose. Accomplishments that we're proud of We are proud of the fact that starting off we had no idea how vector databases worked in practice and when we finished we all have confidence that given the circumstance we have a similar degree of confidence to use it as more established databases. We were also proud of the fact that we created a full fledged product. There are definitely things we can add and improve given a longer timeframe but the framework for that has been set up. What we learned We learned how vector databases work and how to implement them. We also learned how to use multiple APIs and how to coordinate all the data to create a good user experience. What's next for Dynamic Vector Based Spotify Recommendation Engine There were a few issues with the Spotify API that the developer team has said they will address. After they do we can also recommend songs that are similar sounding using the same database. In the future we can also combine these two databases and implement a gradient descent model to more accurately optimize the weights for each parameter. Built With cssflaskhtmlhuggingfacejavascriptmusixmatchoauthpineconepythonspotifyapi Try it out github.com Submitted to HackRU Spring 2024 Winner Maverick Track Created by Satvik Srinivas Arun Avasi Varun Gangavarapu Like 1 1 person likes this: Share this project: Updates Satvik Srinivas started this project — Mar 24, 2024 11:20 AM EDT Leave feedback in the comments! Log in or sign up for Devpost to join the conversation. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service"
}