{
  "title": "NavAlone",
  "url": "https://devpost.com/software/navalone",
  "description": "Devpost",
  "technologies": [
    "angular.js",
    "clerk",
    "css",
    "elevenlabs",
    "firebase",
    "html5",
    "javascript",
    "langchain",
    "next.js",
    "ngrok",
    "node.js",
    "openai",
    "pinecone",
    "python",
    "replit",
    "twilio",
    "upstash"
  ],
  "team_members": [],
  "awards": [
    "Winner"
  ],
  "images": [
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://hackharvard-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/632/445/datas/gallery.jpg",
      "alt": "NavAlone – screenshot 1"
    },
    {
      "src": "https://hackharvard-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/632/598/datas/gallery.jpg",
      "alt": "NavAlone – screenshot 2"
    },
    {
      "src": "https://hackharvard-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/632/623/datas/gallery.jpg",
      "alt": "NavAlone – screenshot 3"
    },
    {
      "src": "https://hackharvard-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/632/648/datas/gallery.jpg",
      "alt": "NavAlone – screenshot 4"
    },
    {
      "src": "https://hackharvard-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/challenge_thumbnails/002/580/396/datas/medium.png",
      "alt": "image"
    },
    {
      "src": "https://hackharvard-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/002/267/789/datas/profile.png",
      "alt": "Aashish Dhakal"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/110642252?height=180&v=4&width=180",
      "alt": "Ishan Pathak"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/AAcHTteXLv6BbGqW4Z3Hv8WY0cN1s9et57yBc66COr5s54Jk=s96-c?height=180&width=180",
      "alt": "Anna Sims"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/AAcHTteXLv6BbGqW4Z3Hv8WY0cN1s9et57yBc66COr5s54Jk=s96-c?type=square",
      "alt": "Anna Sims"
    },
    {
      "src": "https://hackharvard-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/002/267/789/datas/medium.png",
      "alt": "Aashish Dhakal"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/AAcHTteXLv6BbGqW4Z3Hv8WY0cN1s9et57yBc66COr5s54Jk=s96-c?height=180&width=180",
      "alt": "Anna Sims"
    }
  ],
  "links": [
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/632/445/datas/original.png"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/632/598/datas/original.png"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/632/623/datas/original.png"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/632/648/datas/original.jpg"
    },
    {
      "text": "nevalone.replit.app",
      "url": "https://nevalone.replit.app/"
    },
    {
      "text": "github.com",
      "url": "https://github.com/tesims/Hack-Harvard"
    },
    {
      "text": "0ca8b475cdb0.ngrok.app",
      "url": "https://0ca8b475cdb0.ngrok.app"
    },
    {
      "text": "github.com",
      "url": "https://github.com/aadhakal/NavAlone"
    },
    {
      "text": "Twitter",
      "url": "https://twitter.com/devpost"
    },
    {
      "text": "Discord",
      "url": "https://discord.com/invite/HP4BhW3hnp"
    },
    {
      "text": "Facebook",
      "url": "https://www.facebook.com/devposthacks"
    },
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/company/devpost/"
    }
  ],
  "full_content": "NavAlone | Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up NavAlone Reconnect with loved ones, even those who've passed, with NavAlone - your personal AI companion for seniors facing loneliness, grief, and dementia. Like 2 Comment Story Updates Logo Landing Page For Seniors Progressive Mobile App Inspiration We started this project because we observed the emotional toll loneliness, grief, and dementia challenges can take on individuals and their caregivers, and we wanted to create a solution that could make a meaningful difference in their lives. Loneliness is especially tough on them, affecting both their mental and physical health. Our aim was simple: to offer them some companionship and comfort, a reminder of the good memories, and a way to feel less alone. What it does Using the latest AI technology, we create lifelike AI clones of their closest loved ones, whether living or passed away, allowing seniors to engage in text or phone conversations whenever they wish. For dementia patients and their caregivers, our product goes a step further by enabling the upload of cherished memories to the AI clones. This not only preserves these memories but also allows dementia patients to relive them, reducing the need to constantly ask caregivers about their loved ones. Moreover, for those who may forget that a loved one has passed away, our technology helps provide continuous connection, eliminating the need to repeatedly go through the grief of loss. It's a lifeline to cherished memories and emotional well-being for our senior community. How we built it We've developed a platform that transforms seniors' loved ones into AI companions accessible through web browsers, SMS, and voice calls. This technology empowers caregivers to customize AI companions for the senior they are in charge of, defining the companion personality and backstory with real data to foster the most authentic interaction, resulting in more engaging and personalized conversations. These interactions are stored indefinitely, enabling companions to learn and enhance their realism with each use. We used the following tools. . . Auth --> Clerk + Firebase App logic --> Next.js VectorDB --> Pinecone LLM orchestration --> Langchain.js Text model --> OpenAI Text streaming --> ai sdk Conversation history --> Upstash Deployment --> Ngrok Text and call with companion --> Twilio Landing Page --> HTML, CSS, Javascript Caregiver Frontend --> Angular Voice Clone --> ElevenLabs Challenges we ran into One of the significant challenges we encountered was in building and integrating two distinct front ends. We developed a Next.js front end tailored for senior citizens' ease of use, while a more administrative Angular front end was created for caregivers. Additionally, we designed a landing page using a combination of HTML, CSS, and JavaScript. The varying languages and technologies posed a challenge in ensuring seamless connectivity and cohesive operation between these different components. We faced difficulties in bridging the gap and achieving the level of integration we aimed for, but through collaborative efforts and problem-solving, we managed to create a harmonious user experience. Accomplishments that we're proud of We all tackled frameworks we weren't so great at, like Next.js. And, together, we built a super cool project with tons of real-world uses. It's a big deal for us because it's not just tech, it's helping seniors and caregivers in many ways. We've shown how we can learn and innovate, and we're stoked about it! What we learned We learned how to construct vector databases, which was an essential part of our project. Additionally, we discovered the intricacies of connecting the front-end and back-end components through APIs. What's next for NavAlone We would like to improve the AI clone phone call feature. We recognize that older users often prefer phone calls over texting, and we want to make this experience as realistic, fast, and user-friendly as possible. Built With angular.jsclerkcsselevenlabsfirebasehtml5javascriptlangchainnext.jsngroknode.jsopenaipineconepythonreplittwilioupstash Try it out nevalone.replit.app github.com 0ca8b475cdb0.ngrok.app github.com Submitted to HackHarvard 2023 Winner First-time hack Created by During the development of our app, my primary responsibilities encompassed frontend development using Angular and Ionic and Node.js for progressive web-application functionalities. I ensured a seamless user experience by implementing a robust user authentication system, which employed Firebase to securely register, log in, and manage user sessions. I played a pivotal role in integrating the frontend with backend services, ensuring smooth data exchange. Further enhancing our data interactions, I used Firebase for efficient data storage and retrieval, boosting our app's scalability and performance. On the backend, I contributed to setting up API endpoints with Next.js and ensured that our system maintained high levels of security and reliability. Through our concerted team efforts and thorough testing, we achieved a holistic and robust application ready to serve our users effectively. Aashish Dhakal \"Contributed to the project by actively engaging in front-end development and implementing Firebase authentication and Firestore, ensuring the seamless integration of user authentication and data storage. Worked collaboratively to enhance the user experience and data management while bringing a solid foundation to the project.\" Ishan Pathak Anna Sims Like 2 2 people like this: Share this project: Updates Anna Sims started this project — Oct 22, 2023 07:02 AM EDT Leave feedback in the comments! Log in or sign up for Devpost to join the conversation. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service"
}