{
  "title": "Duet: Brainwaves -> Live Music",
  "url": "https://devpost.com/software/duet-0tbkxe",
  "description": "Devpost",
  "technologies": [
    "emotiv",
    "gemini",
    "next.js",
    "python",
    "ruby",
    "singlestore",
    "sonicpi"
  ],
  "team_members": [],
  "awards": [
    "Winner"
  ],
  "images": [
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/090/054/datas/gallery.jpg",
      "alt": "Duet: Brainwaves -> Live Music – screenshot 1"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/090/055/datas/gallery.jpg",
      "alt": "Duet: Brainwaves -> Live Music – screenshot 2"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/090/056/datas/gallery.jpg",
      "alt": "Duet: Brainwaves -> Live Music – screenshot 3"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/090/057/datas/gallery.jpg",
      "alt": "Duet: Brainwaves -> Live Music – screenshot 4"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/challenge_thumbnails/003/083/836/datas/medium.png",
      "alt": "image"
    },
    {
      "src": "https://lh3.googleusercontent.com/a-/AOh14Gj2hlhfs71Rv2Go332_Q1uVFFUMWO_2RAd-PbdcgQ=s96-c?height=180&width=180",
      "alt": "Justin Wu"
    },
    {
      "src": "https://avatars2.githubusercontent.com/u/48817411?height=180&v=4&width=180",
      "alt": "Sophia Zhang"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/AGNmyxb4ZpdH4HPOPOv1GR4kA48ksW8ooDSkjCQfm6Pi=s96-c?height=180&width=180",
      "alt": "Daniel Wang"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/ACg8ocIJEoKm1uwuhMPMTZY2htuOFg7OxEBikUEJnz6uz1xC4WC-yw=s96-c?height=180&width=180",
      "alt": "Jiahui Jin"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/003/230/723/datas/medium.gif",
      "alt": "Kaien Hung"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/ACg8ocJpIXrhrpHCjZ3Sze9Sk7trrSBJmmiQfBg0zcfcgxBOOt1Vuqzs=s96-c?type=square",
      "alt": "Isabella Linde"
    },
    {
      "src": "https://lh3.googleusercontent.com/a-/AOh14Gh2lPUKujCaO-CVRCLQlcSaNS7m9iVH6L9xTA7NdA?type=square",
      "alt": "Mayur Choudhary"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/003/408/664/datas/medium.jpg",
      "alt": "Devica Verma"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/003/093/969/datas/medium.jpeg",
      "alt": "Jeremy Chen"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/001/116/266/datas/medium.jpeg",
      "alt": "Abdur Aziz"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/105874877?type=square&v=4",
      "alt": "Priyansh Shah"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/158545197?type=square&v=4",
      "alt": "Rahul Sudev"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/AGNmyxb4ZpdH4HPOPOv1GR4kA48ksW8ooDSkjCQfm6Pi=s96-c?type=square",
      "alt": "Daniel Wang"
    },
    {
      "src": "https://cal-hacks-11-0.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/002/349/101/datas/medium.JPG",
      "alt": "Rachel Chen"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/AGNmyxb4ZpdH4HPOPOv1GR4kA48ksW8ooDSkjCQfm6Pi=s96-c?height=180&width=180",
      "alt": "Daniel Wang"
    }
  ],
  "links": [
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/090/054/datas/original.jpg"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/090/055/datas/original.jpg"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/090/056/datas/original.jpg"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/090/057/datas/original.jpg"
    },
    {
      "text": "github.com",
      "url": "https://github.com/daniel04wawng/duet-frontend"
    },
    {
      "text": "github.com",
      "url": "https://github.com/soapantelope/duet-backend"
    },
    {
      "text": "Twitter",
      "url": "https://twitter.com/devpost"
    },
    {
      "text": "Discord",
      "url": "https://discord.com/invite/HP4BhW3hnp"
    },
    {
      "text": "Facebook",
      "url": "https://www.facebook.com/devposthacks"
    },
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/company/devpost/"
    }
  ],
  "full_content": "Duet: Brainwaves -> Live Music | Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up Duet: Brainwaves -> Live Music Creativity is inherent, but expressing it is hard. Duet reads live brainwaves via EEG and uses AI to generate evolving soundscapes that reflect your emotions, giving voice to your inner symphony. Like 31 Comment 5 Story Updates Duet's music generation revolutionizes how we approach music therapy. We capture real-time brainwave data using Emotiv EEG technology, translating it into dynamic, personalized soundscapes live. Our platform, backed by machine learning, classifies emotional states and generates adaptive music that evolves with your mind. We are all intrinsically creative, but some—whether language or developmental barriers—struggle to convey it. We’re not just creating music; we’re using the intersection of art, neuroscience, and technology to let your inner mind shine. About the project Inspiration Duet revolutionizes the way children with developmental disabilities—approximately 1 in 10 in the United States—express their creativity through music by harnessing EEG technology to translate brainwaves into personalized musical experiences. Daniel and Justin have extensive experience teaching music to children, but working with those who have developmental disabilities presents unique challenges: Identifying and adapting resources for non-verbal and special needs students. Integrating music therapy principles into lessons to foster creativity. Encouraging improvisation to facilitate emotional expression. Navigating the complexities of individual accessibility needs. Unfortunately, many children are left without the tools they need to communicate and express themselves creatively. That's where Duet comes in. By utilizing EEG technology, we aim to transform the way these children interact with music, giving them a voice and a means to share their feelings. At Duet, we are committed to making music an inclusive experience for all, ensuring that every child—and anyone who struggles to express themselves—has the opportunity to convey their true creative self! What it does: Wear an EEG Experience your brain waves as music! Focus and relaxation levels will change how fast/exciting vs. slow/relaxing the music is. How we built it: We started off by experimenting with Emotiv’s EEGs — devices that feed a stream of brain wave activity in real time! After trying it out on ourselves, the CalHacks stuffed bear, and the Ariana Grande cutout in the movie theater, we dove into coding. We built the backend in Python, leveraging the Cortex library that allowed us to communicate with the EEGs. For our database, we decided on SingleStore for its low latency, real-time applications, since our goal was to ultimately be able to process and display the brain wave information live on our frontend. Traditional live music is done procedurally, with rules manually fixed by the developer to decide what to generate. On the other hand, existing AI music generators often generate sounds through diffusion-like models and pre-set prompts. However, we wanted to take a completely new approach — what if we could have an AI be a live “composer”, where it decided based on the previous few seconds of live emotional data, a list of available instruments it can select to “play”, and what it previously generated to compose the next few seconds of music? This way, we could have live AI music generation (which, to our knowledge, does not exist yet). Powered by Google’s Gemini LLM, we crafted a prompt that would do just that — and it turned out to be not too shabby! To play our AI-generated scores live, we used Sonic Pi, a Ruby-based library that specializes in live music generation (think DJing in code). We fed this and our brain wave data to a frontend built in Next.js to display the brain waves from the EEG and sound spectrum from our audio that highlight the correlation between them. Challenges: Our biggest challenge was coming up with a way to generate live music with AI. We originally thought it was impossible and that the tech wasn’t “there” yet — we couldn’t find anything online about it, and even spent hours thinking about how to pivot to another idea that we could use our EEGs with. However, we eventually pushed through and came up with a completely new method of doing live AI music generation that, to our knowledge, doesn’t exist anywhere else! It was most of our first times working with this type of hardware, and we ran into many issues with getting it to connect properly to our computers — but in the end, we got everything to run smoothly, so it was a huge feat for us to make it all work! What’s next for Duet? Music therapy is on the rise – and Duet aims to harness this momentum by integrating EEG technology to facilitate emotional expression through music. With a projected growth rate of 15.59% in the music therapy sector, our mission is to empower kids and individuals through personalized musical experiences. We plan to implement our programs in schools across the states, providing students with a unique platform to express their emotions creatively. By partnering with EEG companies, we’ll ensure access to the latest technology, enhancing the therapeutic impact of our programs. Duet gives everyone a voice to express emotions and ideas that transcend words, and we are committed to making this future a reality! Built with: Emotiv EEG headset SingleStore real-time database Python Google Gemini Sonic Pi (Ruby library) Next.js Built With emotivgemininext.jspythonrubysinglestoresonicpi Try it out github.com github.com Submitted to Cal Hacks 11.0 Winner Cal Hacks: 1st Overall Created by I mostly worked on the backend, converting brainwaves to audio (Python, Gemini API, SingleStore/SQL, Sonic Pi/Ruby)! Justin Wu I worked on the brainwaves -> music process (python, working w/ Gemini, SingleStore SQL database, ruby audio synth, etc.)! Sophia Zhang (Soap) I worked on the front-end, developing the 3D brain model, brain waves, and audio visualizer (first time learning how to use three.js) Daniel Wang Jiahui Jin Like 31 31 people like this: + 21 more Share this project: Updates Daniel Wang started this project — Oct 20, 2024 01:32 PM EDT Leave feedback in the comments! Log in or sign up for Devpost to join the conversation. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service"
}