{
  "title": "FarmShield",
  "url": "https://devpost.com/software/fear-the-fork",
  "description": "Devpost",
  "technologies": [
    "css",
    "excel",
    "excel-vba",
    "gee",
    "gee-data-catalog-api",
    "gee-javascript-api",
    "gee-python-api",
    "google-cloud",
    "google-earth-engine",
    "html",
    "javascript",
    "node.js",
    "rest",
    "sas"
  ],
  "team_members": [],
  "awards": [
    "Winner"
  ],
  "images": [
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://hackprinceton-spring-2024.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/830/610/datas/gallery.jpg",
      "alt": "FarmShield – screenshot 1"
    },
    {
      "src": "https://hackprinceton-spring-2024.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/830/608/datas/gallery.jpg",
      "alt": "FarmShield – screenshot 2"
    },
    {
      "src": "https://hackprinceton-spring-2024.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/challenge_thumbnails/002/818/159/datas/medium.png",
      "alt": "image"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/103538896?height=180&v=4&width=180",
      "alt": "Mannan Anand"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/ACg8ocJhVNc5UkIoK5S7Xv_6f4ifarD6mwTDWsbPiQEt6MEs=s96-c?height=180&width=180",
      "alt": "Shaashvat Mittal"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/ACg8ocJhVNc5UkIoK5S7Xv_6f4ifarD6mwTDWsbPiQEt6MEs=s96-c?type=square",
      "alt": "Shaashvat Mittal"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/103538896?height=180&v=4&width=180",
      "alt": "Mannan Anand"
    }
  ],
  "links": [
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/830/610/datas/original.png"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/830/608/datas/original.jpeg"
    },
    {
      "text": "sites.google.com",
      "url": "https://sites.google.com/view/farmshield/home"
    },
    {
      "text": "Twitter",
      "url": "https://twitter.com/devpost"
    },
    {
      "text": "Discord",
      "url": "https://discord.com/invite/HP4BhW3hnp"
    },
    {
      "text": "Facebook",
      "url": "https://www.facebook.com/devposthacks"
    },
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/company/devpost/"
    }
  ],
  "full_content": "FarmShield | Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up FarmShield Cultivating Confidence, Harvesting Security Like 1 Comment Story Updates FarmShield: A Paradigm Shift in Agricultural Insurance and Crop Protection Introduction In the complex landscape of agricultural insurance, the process for farmers to secure appropriate coverage has been notoriously challenging. Predicated on the intricate interplay of government regulations and insurance company policies, the accessibility of fair insurance premiums has remained elusive. FarmShield emerged as a response to these challenges, with a vision to streamline and enhance the accessibility of farm insurance through technological innovation. Development Insight Our journey commenced with an in-depth analysis of the existing insurance framework, which revealed a significant reliance on USDA decisions, leading to minimal flexibility in premium adjustments by insurance providers. This insight laid the foundational premise for FarmShield: to introduce a custom safety score, enabling reductions in insurance rates by 5-30% through advanced satellite imagery analysis. Data Acquisition and Analysis The cornerstone of our approach involved meticulous data mining efforts, leveraging both public and proprietary datasets. Utilizing SAS software, we conducted rigorous regression analysis to unearth patterns and correlations between farm practices, environmental factors, and crop yield outcomes. This empirical analysis facilitated the creation of synthetic datasets, simulating potential insurance discounts grounded in quantifiable risk assessments. Satellite Imagery Utilization A pivotal aspect of FarmShield's innovation lies in the utilization of satellite imagery. By harnessing this technology, we generated detailed visual data maps of agricultural land, enabling the precision assessment of crop health, soil moisture levels, and other critical agronomic factors. This comprehensive analysis underpins our safety score algorithm, offering a nuanced risk evaluation mechanism that transcends traditional insurance assessment models. Machine Learning for Crop Protection Parallel to our insurance innovation, we developed a machine learning model designed to diagnose plant health issues. This model was trained using an extensive dataset comprising images of healthy and diseased crops, encompassing a broad spectrum of agricultural diseases. Through advanced image recognition techniques, the model provides instantaneous diagnostic insights, empowering farmers with actionable information to safeguard their crops against potential threats. Challenges and Solutions The endeavor to meld complex datasets, advanced analytics, and machine learning into a cohesive platform was fraught with challenges. Data normalization, ensuring model accuracy across diverse crop types, and the integration of disparate data sources required a multifaceted approach. Our solution was iterative refinement: continuous model training, validation, and adjustment, guided by both quantitative data and qualitative feedback from early adopters. Professional Engagement FarmShield represents a collaborative effort between technology experts and the agricultural community. As a team of two, our roles spanned the gamut of data science, software development, and stakeholder engagement. This project is not merely a testament to technological innovation but a reflection of our commitment to enhancing the resilience and productivity of the farming sector. Conclusion FarmShield stands at the confluence of agriculture and technology, embodying a forward-thinking approach to farm insurance and crop protection. Through diligent data analysis, innovative application of satellite imagery, and the development of a predictive machine learning model, we have laid the groundwork for a more equitable and informed agricultural insurance landscape. As we advance, we remain dedicated to refining our methodologies, expanding our dataset, and continuously improving the utility and accuracy of FarmShield for the agricultural community. Built With cssexcelexcel-vbageegee-data-catalog-apigee-javascript-apigee-python-apigoogle-cloudgoogle-earth-enginehtmljavascriptnode.jsrestsas Try it out sites.google.com Submitted to HackPrinceton Spring 2024 Winner Best Environment Hack -- Track Prize Created by Mannan Anand Shaashvat Mittal Like 1 1 person likes this: Share this project: Updates Mannan Anand started this project — Mar 31, 2024 08:29 AM EDT Leave feedback in the comments! Log in or sign up for Devpost to join the conversation. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service"
}