{
  "title": "ConnectED",
  "url": "https://devpost.com/software/connected-g3alec",
  "description": "Devpost",
  "technologies": [
    "canva",
    "godaddy",
    "trello",
    "wix"
  ],
  "team_members": [],
  "awards": [
    "Winner"
  ],
  "images": [
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://technica-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/630/198/datas/gallery.jpg",
      "alt": "ConnectED – screenshot 1"
    },
    {
      "src": "https://technica-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/challenge_thumbnails/002/602/188/datas/medium.png",
      "alt": "image"
    },
    {
      "src": "https://technica-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/001/715/171/datas/profile.jpg",
      "alt": "Shruti Sekar"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/ALm5wu0cD9vrat2dpXDQjXbycxxmQz6uPhHDwZQM4Dnibw=s96-c?height=180&width=180",
      "alt": "Nikita Alluri"
    },
    {
      "src": "https://technica-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/002/942/041/datas/profile.JPG",
      "alt": "Dhaksha Kannan"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/AATXAJxYBp1bybDEchR_G8ABT79tGJFDysDV6KES74Na=s96-c?height=180&width=180",
      "alt": "Swetha Sathishkumar"
    },
    {
      "src": "https://technica-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/001/715/171/datas/profile.jpg",
      "alt": "Shruti Sekar"
    }
  ],
  "links": [
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/630/198/datas/original.png"
    },
    {
      "text": "https://docs.google.com/spreadsheets/d/1uRA6gjZ9xqJCdl2IDxpde7CRh8MmNhDfgrAaW1KJE54/edit?usp=sharing",
      "url": "https://docs.google.com/spreadsheets/d/1uRA6gjZ9xqJCdl2IDxpde7CRh8MmNhDfgrAaW1KJE54/edit?usp=sharing"
    },
    {
      "text": "connectedhq.co",
      "url": "http://connectedhq.co"
    },
    {
      "text": "docs.google.com",
      "url": "https://docs.google.com/presentation/d/1Vy2uuCEHVnJ_xorYk6-EJQ7SIKlFmgHb6YF_6x9WgpM/edit?usp=sharing"
    },
    {
      "text": "Twitter",
      "url": "https://twitter.com/devpost"
    },
    {
      "text": "Discord",
      "url": "https://discord.com/invite/HP4BhW3hnp"
    },
    {
      "text": "Facebook",
      "url": "https://www.facebook.com/devposthacks"
    },
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/company/devpost/"
    }
  ],
  "full_content": "ConnectED | Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up ConnectED Are you an immigrant looking for more info for your children's education within the American school systems? Parents work with consultants in ConnectED to be more informed on the US K-12 system. Like Comment Story Updates ConnectED: Our startup to connect education across consultants and immigrant parents Inspiration In the US, there are approximately 18 million minors who lived with one parent who is an immigrant according to data collected in 2021. As immigrants and children of immigrants, we often hear: \"What vaccines do we need to school? Could you please tell me more about the college application process? What is GPA?\" Since our family friends have younger kids, we often hear anxious parents wanting to make the best choice for their children's education and decide to come to us for advice. However, many parents feel that since they didn't study in the US education system, they aren't qualified to make decisions for their kids due to unfamiliar systems and language barriers. What it does ConnectED is an educational consulting startup that connects parents who are unfamiliar with the American Public School System with consultants who provide guidance to them on the K-12 education system. Parents can talk to consultants for more in depth explanations of the education system. Our website allows parents to schedule booking with the consultants and seek one-on-one guidance from the consultants. How we built it Our website is built on top of Wix. We used Canva for designing our logo and choosing our color schemes, Trello for project management, GoDaddy for our domain name. Challenges we ran into We ran into trouble trying to figure out how to integrate the ChatGPT chatbot with Wix. We originally wanted to use a chatbot with Wix Chat, but it turned out that you will need to create a server with Node.js or another server-side validation method which we were not able to do since the platform for Wix code cost money to use. Another challenge we ran into was trying to translate the site. We used the auto-translate feature of Wix to include languages, but they had a word limit. If we had more money, we would be able to translate more words, but for now we decided to try to translate a little bit. Accomplishments that we're proud of We're really proud of coming up with a startup idea. We were able to create a business subscription model and figure out how to create a startup out of the problem. We also conducted a small user study to understand how students at the hackathon's parents interacted with them. We had about 10 people respond, which was valuable to demonstrate some correlations between immigration status and parental educational involvement. We also realized that paywalls might negatively affect our ability to implement features we want. Our survey responses: https://docs.google.com/spreadsheets/d/1uRA6gjZ9xqJCdl2IDxpde7CRh8MmNhDfgrAaW1KJE54/edit?usp=sharing What we learned We learned more concepts about venture capitalism through the workshops. We also learned a lot about CMS software and how it can be integrated with other tools to create a product. We learned a little bit about API connections when we researched how to connect OpenAI's tools or Google Cloud tools. What's next for ConnectED We hope to create a student portal and consultant portal. Right now, we built a parent portal to help parents learn more about the education system. We also hope to integrate a good chatbot that responds to parent questions. Built With canvagodaddytrellowix Try it out connectedhq.co docs.google.com Submitted to Technica 2023 Winner Best Startup Track Hack Created by Shruti Sekar Nikita Alluri Dhaksha Kannan Swetha Sathishkumar Like Share this project: Updates Shruti Sekar started this project — Oct 21, 2023 01:30 PM EDT Leave feedback in the comments! Log in or sign up for Devpost to join the conversation. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service"
}