{
  "title": "DroneFormer",
  "url": "https://devpost.com/software/droneformer",
  "description": "Devpost",
  "technologies": [
    "ml",
    "openai",
    "python"
  ],
  "team_members": [],
  "awards": [
    "Winner"
  ],
  "images": [
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost logo"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
      "alt": "Devpost"
    },
    {
      "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
      "alt": "Devpost for Teams logo"
    },
    {
      "src": "https://treehacks-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/388/969/datas/gallery.jpg",
      "alt": "DroneFormer – screenshot 1"
    },
    {
      "src": "https://treehacks-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/388/970/datas/gallery.jpg",
      "alt": "DroneFormer – screenshot 2"
    },
    {
      "src": "https://treehacks-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/challenge_thumbnails/002/331/982/datas/medium.png",
      "alt": "image"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/14876698?height=180&v=4&width=180",
      "alt": "Sidhant Bendre"
    },
    {
      "src": "https://graph.facebook.com/2074410005969608/picture?height=180&width=180",
      "alt": "Michael Tang"
    },
    {
      "src": "https://lh3.googleusercontent.com/a/AEdFTp6S5B1Am7KGwrpgi2Ex3wF_QLVivIdAaP6pTPdu=s96-c?height=180&width=180",
      "alt": "Ioana Marinescu"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/60076597?height=180&v=4&width=180",
      "alt": "Brian Wu"
    },
    {
      "src": "https://avatars3.githubusercontent.com/u/35238826?type=square&v=4",
      "alt": "Emily Yu"
    },
    {
      "src": "https://lh4.googleusercontent.com/-lT5-pK2tQy4/AAAAAAAAAAI/AAAAAAAAAAA/AAKWJJN7tJ6pM06D51X_7q_BFWDTjOYO6g/c/photo.jpg?type=square",
      "alt": "Igor Dmochowski"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/83871892?type=square&v=4",
      "alt": "Srihitha Kurapati"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/71042887?type=square&v=4",
      "alt": "Gaurang Ruparelia"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/57330834?type=square&v=4",
      "alt": "Hussein Lezzaik"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/42438803?type=square&v=4",
      "alt": "Rahul Kandekar"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/106787194?type=square&v=4",
      "alt": "Jacob Rintamaki"
    },
    {
      "src": "https://treehacks-2023.devpost.com//d112y698adiu2z.cloudfront.net/photos/production/user_photos/002/604/656/datas/medium.jpg",
      "alt": "David Shustin"
    },
    {
      "src": "https://graph.facebook.com/2074410005969608/picture?type=square",
      "alt": "Michael Tang"
    },
    {
      "src": "https://avatars.githubusercontent.com/u/60076597?type=square&v=4",
      "alt": "Brian Wu"
    },
    {
      "src": "https://graph.facebook.com/2074410005969608/picture?height=180&width=180",
      "alt": "Michael Tang"
    }
  ],
  "links": [
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "Devpost for Teams\nAccess your company's private hackathons",
      "url": "https://devpost.team"
    },
    {
      "text": "Login",
      "url": "https://devpost.team"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/388/969/datas/original.png"
    },
    {
      "text": "",
      "url": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/388/970/datas/original.png"
    },
    {
      "text": "https://medium.com/@sidhantbendre22/hacking-the-moonshot-stanford-treehacks-2023-9166865d4899",
      "url": "https://medium.com/@sidhantbendre22/hacking-the-moonshot-stanford-treehacks-2023-9166865d4899"
    },
    {
      "text": "github.com",
      "url": "https://github.com/brianwu568/DroneFormer"
    },
    {
      "text": "medium.com",
      "url": "https://medium.com/@sidhantbendre22/hacking-the-moonshot-stanford-treehacks-2023-9166865d4899"
    },
    {
      "text": "Twitter",
      "url": "https://twitter.com/devpost"
    },
    {
      "text": "Discord",
      "url": "https://discord.com/invite/HP4BhW3hnp"
    },
    {
      "text": "Facebook",
      "url": "https://www.facebook.com/devposthacks"
    },
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/company/devpost/"
    }
  ],
  "full_content": "DroneFormer | Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up DroneFormer Controlling UAVs with natural language! Like 14 Comment Story Updates POCARI SWEAT!!!!!!!!!! It knows what it wants Inspiration Building domain-specific automated systems in the real world is painstaking, requiring massive codebases for exception handling and robust testing of behavior for all kinds of contingencies — automated packaging, drone delivery, home surveillance, and search and rescue are all enormously complex and result in highly specialized industries and products that take thousands of engineering hours to prototype. But it doesn’t have to be this way! Large language models have made groundbreaking strides towards helping out with the similarly tedious task of writing, giving novelists, marketing agents, and researchers alike a tool to iterate quickly and produce high-quality writing exhibiting both semantic precision and masterful high-level planning. Let’s bring this into the real world. What if asking “find the child in the blue shirt and lead them to the dinner table” was all it took to create that domain-specific application? Taking the first steps towards generally intelligent embodied AI, DroneFormer turns high-level natural language commands into long scripts of low-level drone control code leveraging advances in language and visual modeling. The interface is the simplest imaginable, yet the applications and end result can adapt to the most complex real-world tasks. What it does DroneFormer offers a no-code way to program a drone via generative AI. You can easily control your drone with simple written high-level instructions. Simply type up the command you want and the drone will execute it — flying in spirals, exploring caves to locate lost people with depth-first search, or even capturing stunning aerial footage to map out terrain. The drone receives a natural language instruction from the user (e.g. \"find my keys\") and explores the room until it finds the object. How we built it Our prototype compiles natural language instructions down into atomic actions for DJI Tello via in-context learning using the OpenAI GPT-3 API. These actions include primitive actions from the DJI SDK (e.g. forward, back, clockwise turn) as well as custom object detection and visual language model query actions we built leveraging zero-shot image and multimodels models such as YOLOv5 and image processing frameworks such as OpenCV. We include a demo for searching for and locating objects using the onboard Tello camera and object detection. Challenges we ran into One significant challenge was deciding on a ML model that best fit our needs of performant real-time object detection. We experimented with state-of-the-art models such as BLIP and GLIP which either were too slow at inference time, or were not performing as expected in terms of accuracy. Ultimately, we settled on YOLOv5 as having a good balance between latency and ability to collect knowledge about an image. We were also limited by the lack of powerful onboard compute, which meant the drone needs to connect to an external laptop (which needed to serve both the drone and internet networks, which we resolved using Ethernet and wireless at the same time) which in turn connects to the internet for OpenAI API inference. Accomplishments that we're proud of We were able to create an MVP! DroneFormer successfully generates complex 20+ line instructions to detect and navigate to arbitrary objects given a simple natural language instruction to do so (e.g. “explore, find the bottle, and land next to it”). What we learned Hardware is a game changer! Embodied ML is a completely different beast than even a simulated reinforcement learning environment, and working with noisy control systems adds many sources of error on top of long-term language planning. To deal with this, we iterated much more frequently and added functionality to deal with new corner cases and ambiguity as necessary over the course of the project, rewriting as necessary. Additionally, connectivity issues arose often due to the three-tiered nature of the system between the drone, laptop, and cloud backends. What's next for DroneFormer We were constrained by the physical confines of the TreeHacks drone room and obstacles available in the vicinity, as well as the short battery life of the Tello drone. Expanding to larger and more complex hardware, environments, and tasks, we expect the DroneFormer framework to handily adapt, given a bit of prompt engineering, to emergent sophisticated behaviors such as: Watching over a child wandering around the house and reporting any unexpected behavior according to a fine-tuned classifier Finding that red jacket that you could swear was on the hanger but which has suddenly disappeared Checking in “person” if the small coffee shop down the street is still open despite the out-of-date Google Maps schedule Sending you a picture of the grocery list you forgot at home DroneFormer will be a new type of personal assistant — one that always has your back and can bring the magic of complex language model planning to the embodied real world. We’re excited! https://medium.com/@sidhantbendre22/hacking-the-moonshot-stanford-treehacks-2023-9166865d4899 Built With mlopenaipython Try it out github.com medium.com Submitted to TreeHacks 2023 Winner Moonshot Prize: 4 x Segway - G30Max Electric Kick Scooter Created by handled: - prompting - drone control - drone camera stream analytics - drone's decision-making with computer vision Sidhant Bendre Some more projects here: https://devpost.com/sbendre Michael Tang Ioana Marinescu Brian Wu Building an economy in Space powered by AI + Robots. Astrophysicist, VC, & Quant Research in a past life. Like 14 14 people like this: + 4 more Share this project: Updates Michael Tang started this project — Feb 19, 2023 07:01 AM EST Leave feedback in the comments! Log in or sign up for Devpost to join the conversation. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service"
}