{
  "url": "https://cal-hacks-12-0.devpost.com/",
  "event_name": "cal_hacks_12_0",
  "scraped_at": "2025-10-26T00:03:25.974920",
  "rules_data": {
    "overview": {
      "text": "Cal Hacks 12.0: This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas. - Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up Cal Hacks 12.0 Deadline: Oct 26, 2025 @ 9:30am PDT Join hackathon Descend Overview My projects Participants (612) Resources Rules Project gallery Updates Discussions Cal Hacks 12.0 This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas. Join hackathon Who can participate Ages 18+ only College students only Team required All countries/territories, excluding standard exceptions View full rules October 26 at 12:30pm EDT to deadline View schedule Deadline: Oct 26, 2025 @ 9:30am PDT Apple Google Outlook Palace of Fine Arts Public $52,650 in cash 612 participants Cal Hacks Beginner Friendly Machine Learning/AI Open Ended Welcome to Cal Hacks 12.0! We're so excited to have you join us at the Palace of Fine Arts for the world's largest collegiate hackathon. Here are some resources to help you this weekend: Live Site: live.calhacks.io The Slack: calhacks.io/slack We really hope you enjoy the weekend! Chat to any organizer (beige shirts) if you need anything or use the #ask-directors channel on Slack. And, don't forget, go bears! Requirements Submit your hack by 10/26 9:30 AM PDT and make sure to add your teammates! You'll have until 10:30 AM to continue hacking and editing your submission (except for the table number), but the project must be submitted by 9:30 AM. Include an image of your project and GitHub repository for any code to be considered. Include the table number you're presenting from. This cannot change after 10/26 9:30 AM PST. All work must be done during the hackathon You will have two minutes to pitch and two minutes for judges to ask questions of you. You must have a recorded video submission stored locally with a demonstration. Hackathon Sponsors Prizes $52,650+ in prizes + other prizes Cal Hacks: 1st Overall 1 winner Macbook Air or Framework Laptop (13”) Cal Hacks: 2nd Overall 1 winner Meta Ray Bans Cal Hacks: 3rd Overall 1 winner Nintendo Switch Lites Cal Hacks: Best Hardware Hack 1 winner 3D Printers Cal Hacks: Hacker's Choice 1 winner Apple Airpods Cal Hacks: Most Creative Hack 1 winner iPad + Apple Pencil Cal Hacks: Greatest Social Impact 1 winner Apple Watches Cal Hacks: Best Beginner Hack 1 winner FujiFilm Polaroid Camera + Film Claude: Best Use of Claude 1 winner Tungsten Cube + $5000 API Credits. Technical Complexity – Showcases advanced implementation, creative problem-solving, or innovative use of Claude Code beyond basic features. Creative Use Case – Applies Claude Code in unexpected or novel ways that extend beyond standard dev workflows. Impact & Practicality – Tackles real-world problems with clear potential for meaningful, lasting impact. Amazon 1 winner To be announced! AppLovin: Query Planner Challenge $10,000 in cash 1 winner Follow this criteria: https://docs.google.com/document/d/1k1J3HrCThfZyI2PdwgSOwGpT0Vt8Wv_QPhexhhZSatE/edit?tab=t.0#heading=h.gfqe3qx68hy5 AppLovin: Ad Intelligence Challenge $3,000 in cash 1 winner Follow this criteria: https://docs.google.com/document/d/1i2wu_Z6Hb-WDyzM1woYFpqtfyp1Y-0Gc135XvK5fC8g/edit?tab=t.0#heading=h.pzdwayb1o6cg Fetch AI: Best Use of Fetch AI $2,500 in cash 1 winner $2500 + Internship Interview Opportunity Functionality & Technical Implementation (25%) – Works as intended; agents communicate and reason effectively in real time. Use of Fetch.ai Technology (20%) – Agents registered on Agentverse and integrated with the Chat Protocol for ASI:One discoverability. Innovation & Creativity (20%) – Original, inventive solution tackling problems in new or unconventional ways. Real-World Impact & Usefulness (20%) – Solves meaningful problems with clear value for end users. User Experience & Presentation (15%) – Clear demo, smooth UX, and well-structured presentation. Fetch AI: Best Deployment of Agentverse $1,500 in cash 1 winner $1500 + Internship Interview Opportunity Functionality & Technical Implementation (25%) – Works as intended; agents communicate and reason effectively in real time. Use of Fetch.ai Technology (20%) – Agents registered on Agentverse and integrated with the Chat Protocol for ASI:One discoverability. Innovation & Creativity (20%) – Original, inventive solution tackling problems in new or unconventional ways. Real-World Impact & Usefulness (20%) – Solves meaningful problems with clear value for end users. User Experience & Presentation (15%) – Clear demo, smooth UX, and well-structured presentation. Fetch AI: Best Use of ASI:One $1,000 in cash 1 winner $1000 + Internship Interview Opportunity Functionality & Technical Implementation (25%) – Works as intended; agents communicate and reason effectively in real time. Use of Fetch.ai Technology (20%) – Agents registered on Agentverse and integrated with the Chat Protocol for ASI:One discoverability. Innovation & Creativity (20%) – Original, inventive solution tackling problems in new or unconventional ways. Real-World Impact & Usefulness (20%) – Solves meaningful problems with clear value for end users. User Experience & Presentation (15%) – Clear demo, smooth UX, and well-structured presentation. Y Combinator: Build an Iconic YC Company 3 winners 1st place has a guaranteed interview with a YC partner. 2nd and 3rd place have guaranteed office hours and special swag. Postman 1 winner To be announced! Creao: Best Use of Creao $4,000 in cash 1 winner Projects must include at least one custom registered API on the Creao platform and demonstrate a working system with a short demo or explanation. Each project may enter only one Creao prize track. Judging (100 pts total): Impact (30 pts): Significance of the problem solved Creativity & Innovation (25 pts): Originality and inventive API use Technical Execution (25 pts): Functionality, integration, and smoothness Scalability (10 pts): Potential to expand beyond the hackathon Presentation (10 pts): Clarity and demo quality Ties will be decided by Impact. Teams must submit a brief form with project details and selected prize category. Warp: Best Use of Warp 1 winner Airpods for winners! Prizes will be judged on Innovation, Technicals, Presentation Vapi: Best Use of Vapi 1 winner The winner will win special swag and Vapi credits. Judges will vote on the best use of Voice AI in a project that uses Vapi. Elastic: Best use of the Elastic Agent Builder on a Serverless instance $3,000 in cash 2 winners 1st place: $2000, 2nd place: $1000. Qualified projects must: 1) Ingest and store data within Elastic 2) Using Agent Builder, register custom tools (Queries, actions) 3) Expose custom tools using MCP CodeRabbit: Best Use of CodeRabbit AI 1 winner Rey-Ban Meta AI Glasses Judging Criteria: Innovation (30%) – Creative use of CodeRabbit’s AI to enhance development. Technical Implementation (30%) – Quality of CodeRabbit integration in workflow. Impact (25%) – Improvement to productivity, collaboration, or code quality. Presentation (15%) – Clear demo, explanation, and results. Sui: Best Use of Sui 1 winner Water bottles, T-shirts, and cash prizes Rox: Best Use of Rox 1 winner Cash prize, value to be announced! LiveKit: Most Complex / Technically Challenging 1 winner Interviews for the engineering team at LiveKit Most Complex / Technically Challenging – Advanced use of LiveKit’s Agents framework or other SDKs. LiveKit: Most Creative Project 1 winner Apple Airpod Pro with engraved case Most Creative Project – Unique or unexpected application of LiveKit, voice, or video agents. LiveKit: Best Start-up Idea 1 winner Jetson Orin Nano Super Developer Kit 3 Best Startup Idea – Strong market potential, clear value, and monetization viability. The Bright Data: Best Use of Bright Data 3 winners 1st Prize: $1,500 Bright Data credits, $500 Amazon gift card 2nd Prize: $1,000 Bright Data credits, $300 Amazon gift card 3rd Prize: $500 Bright Data credits, $150 Amazon gift card Visa $200 in cash 1 winner $200 in Gift cards Reka: Best Use of Reka 1 winner Reka Credits and recognition as a showcased project on Reka’s website Conversion: Best Use of Conversion 1 winner Vespa Scooter (or cash equivalent) Projects must incorporate workflows, ideally using Temporal, and include a workflow builder as part of the application. Judging Criteria: Entries will be evaluated based on technical acumen and creativity. Conway: Most Data-Intensive Application 1 winner 4 WHOOP watches Data-Intensive Applications We’re looking for projects that process large volumes of data with significant computation per record — such as transactions, sensor readings, or user interactions — while performing complex operations like pattern matching, aggregation, or model inference. Lava: Best Use of Lava Gateway $4,000 in cash 3 winners 1st place: $2.5K cash 2nd place: $1K cash 3rd place: $500 cash Hackers looking to participate in the Lava Tech Prize only need to ensure that they incorporate Lava Gateway when they're building their project. Bonus points, but not necessary, if they also set up an initial pricing configuration with Lava. After meeting the initial criteria, hackers will be judged on the quality, functionality, creativity, and business viability of their projects. Composio: Best Use of Composio Toolrouter 1 winner $4K in Composio Credits Judging Criteria: Creativity – Originality of the problem statement and the proposed solution. Usefulness – Practical value and relevance to a clear customer segment. Integration Depth – Extensive use of Composio Toolrouter to connect and orchestrate multiple applications. Crater: Play-Do Prize 1 winner Awarded to the hack with the most composable, iterative, and playful design — spanning software, hardware, or deep tech. We’re looking for creativity, elasticity, and usefulness in products or features that build on themselves or adapt in unexpected ways, making users say, “Wow, how did they do that?” Prize: Winner’s choice of: 4× Meta Ray-Ban Display & Neural Band (pre-ordered and paid for by Crater), or “Hack for the Cow” — Crater buys a cow outright from our partner dairy farm, providing lifetime room and board, annual milk shipments, and fractional ownership among the team. Promise: Public Impact Prize (sponsored by Promise) 1 winner Exclusive Dinner in Berkeley with Leaders from YCombinator, Palantir, Google, and the White House + fast track interview with Promise's CTO. Criteria: Impact on Underserved Communities – addresses real world problems impacting low-income, at-risk, or otherwise marginalized individuals or communities. AI for Accessibility – use of communication AI (voice, chat, etc.) to drive down barrier of entry. Innovation – creative, forward-thinking application of technology. Usefulness and Pragmatism -- solutions demonstrates understanding the problem and thoughtfulness on real-world viability. A37: Best Use of A37 1 winner Nuphy Field75 HEs ($150/person) and runner ups will receive $50/person Main components to judge: system design, implementation, innovation, impact, presentation System design (30 points) - Clarity (10): Is the overall architecture easy to understand (diagram + explanation)? - Modularity (10): Did they design cleanly - modular services, good separation of concerns, minimal “hackiness”? - Scalability (10): Could this design handle increased load or additional users with minimal redesign? Implementation & Usage (25 pts) - Execution (10): Did they actually spin up infrastructure (e.g., Docker, cloud services, Kubernetes, Terraform, etc.)? - Automation (10): Did they automate setup or deployment (scripts, IaC, pipelines, containers)? - Reproducibility (5): Can others run it easily (README, clear setup, demo)? Innovation (20 pts) - Originality (10): Did they use infrastructure in a clever or unexpected way? - Problem-Solving (10): Did they engineer around limits (cost, APIs, permissions, time) in a smart way? Impact (15 pts) - Utility (10): Does it address a real infrastructure challenge (deployments, monitoring, scaling, DevOps pain points)? - Applicability (5): Could their approach reasonably be extended or integrated in a real-world system? Presentation (10 pts) - Explanation (5): Can the team clearly articulate their architecture and tradeoffs? - Comprehension (5): Do they show genuine understanding of the infra concepts they used? SnapDev 1 winner Nintendo Switches All finalists must have a live product 1/ Innovation and Creativity (25%) 2/ Impact and usefulness (25%) 3/ User experience (25%) 4/ Communication and presentation (25%) Snap: Best Use of Snap Spectacles 1 winner 1st place: Spectacles for each winning team member 2nd place: Nintendo Switch (1st gen) for each winning team member 3rd place: Soundview speakers for each winning team member Judging criteria is (1) technical implementation (2) innovation & creativity (3) Functionality & features (4) Impact & social relevance (5) user experience (6) visual & aesthetic quality Ripple: Best Use of XRP Ledger $1,000 in cash 3 winners $1,000 (1st), $500 (2nd); $250 for best developer feedback XRPL Track — Build an MVP Create a working MVP using the XRP Ledger to solve a real-world financial problem. Suggested areas: payments, RLUSD apps, RWA tokenization, or decentralized identity (DID). Features we’re looking for: RLUSD-based apps or SDKs DID-integrated fintech identity flows Developer SDKs exposing XRPL features (escrows, tokens, RLUSD) Payment apps, microfinance, or RWA tokenization Requirements & Awards: MVP must be public on GitHub with a detailed README Show how XRPL can drive real DeFi innovation! Regeneron $8,000 in cash 1 winner Regeneron CalHacks prize rubric & criteria will be at https://regn.link/Calhacks Groq: Best Use of Groq 1 winner $100 in Groq Credit, lego McClarens for each member Ethereum Foundation: Best App Built on Ethereum, or an Ethereum L2 1 winner Mainnet ETH for top hackers 1. Technical Implementation – Depth, originality, and quality of the build; effective use of Ethereum/L2 (contracts, SDKs, infrastructure); code quality, scalability, and security. 2. Relevance to Ethereum (25%) – Meaningful use of Ethereum features (smart contracts, composability, on-chain logic); adherence to Ethereum principles; preference for projects only possible on Ethereum. 3. Innovation & Creativity – Novel ideas or approaches; use of emerging primitives (account abstraction, intents, ERC standards, restaking, AI agents, etc.). 4. User Experience & Design – Clear, simple interface; design that complements technical features. 5. Impact & Potential – Potential to grow into a sustainable product or contribution; addresses real-world or Ethereum ecosystem needs; clearly communicates significance. Interaction Company: Best MCP Automation 1 winner Meta Ray-Bans + Apple AirPods Pro 3 + Interaction × The North Face jackets Most technically impressive automation judged on technical complexity, e.g. elaborate MCP connections, API integrations, novel use of MCP, etc. Letta: Build Your First Stateful AI Agent with Letta Cloud 1 winner AirPods + Letta Swag, Letta Swag for runner-ups Eligibility: Must use Letta Cloud or self-hosted Letta as a core component. Demonstrate stateful agent behavior with meaningful persistent memory. Include a demo showing memory and learning capabilities. Judging Criteria: Creative Use of Memory (35%) – Novel use of Letta’s memory architecture; thoughtful memory blocks; agent learns or adapts over time. Technical Implementation (25%) – Well-executed Letta integration; effective use of features (tools, memory blocks, multi-step reasoning); clean code and architecture. Impact & Usefulness (25%) – Solves a real problem; improves UX through statefulness; people would want to use it. Demo & Presentation (15%) – Demo clearly shows memory in action; persistence across sessions; clear value proposition. Example projects: personal assistants, adaptive tutors, research agents, context-aware support agents, or creative memory-driven applications. Avoid: stateless chatbots, API-only wrappers, or projects that don’t demonstrate meaningful memory. Bonus points: advanced Letta features, creative memory block design, and unique use cases. Resources: workshop, sponsor booth, docs.letta.com, Discord: https://discord.gg/letta JanitorAI: Most Functional, Novel, and Fun Project 1 winner 1 AirPods Max for each team member Projects will be judged for functionality, novelty, and \"fun\". fish.audio: Best use of Fish Audio $250 in cash 1 winner $250 cash per team member, $250 fish audio API credit per team member Technical novelty - is the project technically impressive? Creativity - is the idea creative and novel? Broader Impact - does this project have broad real world impacts? Use of Fish Audio API - does the project use Fish Audio API? Chroma: Best AI application using Chroma $200 in cash 1 winner Most Wacky Hack (presented by Wordware) $1,000 in cash 1 winner $1,000 in cash & $500 in Sauna credit Qualified projects must: 1) Ingest and store data within Elastic 2) Using Agent Builder, register custom tools (Queries, actions) 3) Expose custom tools using MCP [MLH] Best Use of AI powered by Reach Capital 1 winner Logitech Webcam & Meeting with the Reach Capital Investors AI has upended what we can accomplish with technology. Reach Capital invests in the next generation of founders and technical talent, and they want you to use AI to transform the future of learning, health, and work. Build a project that impacts one (or all!) of these areas for a chance to win a Logitech webcam for each member of your team and the exclusive opportunity to discuss your creation with Reach Capital’s team of expert investors. Interested in working at world-changing startups? Reach's 130+ portfolio companies — including Replit, Brilliant, ClassDojo, GPTZero, and Desmos — are always looking for the next wave of talent. Share what you’re studying, building, or exploring, and Reach will connect you to career-defining opportunities. Add your profile and join the hackers already in the Reach talent network. [MLH] Best .Tech Domain Name 1 winner Prize: Blue Snowball Microphone & a Free .Tech Domain Name for up to 10 years! What's in a name? Everything! Especially when it ends in .tech. This prize, brought to you by our partners at Major League Hacking (MLH), will go to the team with the most memorable and innovative .tech domain of the weekend. Winners get to take home a Blue Snowball Microphone and will get their .Tech Domain Name free for up to a decade! [MLH] Best Use of Gemini API 1 winner Prize: Mechanical Keyboards What will you build with the power of next-generation AI? In partnership with Major League Hacking (MLH), this prize is for the team that uses the Google Gemini API to create something truly jaw-dropping. Think bigger than just a chatbot—generate music, analyze scientific papers, or invent a tool that no one has thought of before. Show us the future of AI. The team with the most innovative AI-powered application will win new mechanical keyboards! [MLH] Best Use of Snowflake API 1 winner Arduino Tiny ML Kit Play with industry-leading LLMs on a single account using the Snowflake APIs. Adding AI capabilities into your application can be as simple as a single CURL command to Snowflake’s REST API. Build customized applications, RAG powered chat bots, or embed AI-powered features into your app in half the time with half the hassle. Get started for free with a special, student 120-day Snowflake trial and check out this repository for an example of the Snowflake REST API in action. [MLH] Best Use of ElevenLabs 1 winner Prize: ElevenLabs Apple Airpods 4 Make your project speak for itself! With ElevenLabs' powerful generative voice AI, you can bring your hack to life with realistic, expressive audio. In partnership with Major League Hacking (MLH), we're challenging you to find the most creative or compelling use of their API. From dynamic storytelling to creating interactive user assistants, the possibilities are endless. The winning team will win a set of ElevenLabs branded Airpods! [MLH] Best Use of DigitalOcean Gradient™ AIOpt 1 winner Prize: 8BitDo Retro Mouse DigitalOcean Gradient™ AI is a unified AI cloud for building, training, and deploying machine learning models and AI agents. Get access to GPU infrastructure like DigitalOcean GPU Droplets and Bare Metal servers, along with serverless inference and 1-Click Models for instant deployment of your favorite LLMs!! Sign up for DigitalOcean today and get $200 worth of free credits that you can use towards building your next Gradient-powered hack. Enable your next project with DigitalOcean GradientTM AI for a chance to win some great prizes for you and each of your team mates! Devpost Achievements Submitting to this hackathon could earn you: Judges Ddoski & his not-so judgy buddies. Cal Hacks 12.0 Judging Criteria Application Does the project have any feasible application in real life? Does it seem like something that someone could use or would actually have a benefit in the real world? Functionality/Quality Is the project free of major bugs? Does it look appealing? The UI/UX doesn’t have to be absolutely perfect, but if we're having a hard time understanding the project by looking at it, there may be a problem. Creativity Is this project unique and innovative? Is it a solution to a problem we have never seen before? A better way of doing something? Technical Complexity The team should display a good level of knowledge in terms of the technology they’ve used in implementing their project. Questions? Email the hackathon manager Invite others to compete This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service",
      "structured": {
        "title": "Cal Hacks 12.0: This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas. - Devpost",
        "headings": [
          {
            "tag": "h3",
            "text": "Cal Hacks 12.0"
          },
          {
            "tag": "h1",
            "text": ""
          },
          {
            "tag": "h1",
            "text": "Cal Hacks 12.0"
          },
          {
            "tag": "h3",
            "text": "This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas."
          },
          {
            "tag": "h6",
            "text": "Who can participate"
          },
          {
            "tag": "h3",
            "text": "Requirements"
          },
          {
            "tag": "h3",
            "text": "Hackathon Sponsors"
          },
          {
            "tag": "h3",
            "text": "Prizes"
          },
          {
            "tag": "h6",
            "text": "Cal Hacks: 1st Overall"
          },
          {
            "tag": "h6",
            "text": "Cal Hacks: 2nd Overall"
          },
          {
            "tag": "h6",
            "text": "Cal Hacks: 3rd Overall"
          },
          {
            "tag": "h6",
            "text": "Cal Hacks: Best Hardware Hack"
          },
          {
            "tag": "h6",
            "text": "Cal Hacks: Hacker's Choice"
          },
          {
            "tag": "h6",
            "text": "Cal Hacks: Most Creative Hack"
          },
          {
            "tag": "h6",
            "text": "Cal Hacks: Greatest Social Impact"
          },
          {
            "tag": "h6",
            "text": "Cal Hacks: Best Beginner Hack"
          },
          {
            "tag": "h6",
            "text": "Claude: Best Use of Claude"
          },
          {
            "tag": "h6",
            "text": "Amazon"
          },
          {
            "tag": "h6",
            "text": "AppLovin: Query Planner Challenge"
          },
          {
            "tag": "h6",
            "text": "AppLovin: Ad Intelligence Challenge"
          },
          {
            "tag": "h6",
            "text": "Fetch AI: Best Use of Fetch AI"
          },
          {
            "tag": "h6",
            "text": "Fetch AI: Best Deployment of Agentverse"
          },
          {
            "tag": "h6",
            "text": "Fetch AI: Best Use of ASI:One"
          },
          {
            "tag": "h6",
            "text": "Y Combinator: Build an Iconic YC Company"
          },
          {
            "tag": "h6",
            "text": "Postman"
          },
          {
            "tag": "h6",
            "text": "Creao: Best Use of Creao"
          },
          {
            "tag": "h6",
            "text": "Warp: Best Use of Warp"
          },
          {
            "tag": "h6",
            "text": "Vapi: Best Use of Vapi"
          },
          {
            "tag": "h6",
            "text": "Elastic: Best use of the Elastic Agent Builder on a Serverless instance"
          },
          {
            "tag": "h6",
            "text": "CodeRabbit: Best Use of CodeRabbit AI"
          },
          {
            "tag": "h6",
            "text": "Sui: Best Use of Sui"
          },
          {
            "tag": "h6",
            "text": "Rox: Best Use of Rox"
          },
          {
            "tag": "h6",
            "text": "LiveKit: Most Complex / Technically Challenging"
          },
          {
            "tag": "h6",
            "text": "LiveKit: Most Creative Project"
          },
          {
            "tag": "h6",
            "text": "LiveKit: Best Start-up Idea"
          },
          {
            "tag": "h6",
            "text": "The Bright Data: Best Use of Bright Data"
          },
          {
            "tag": "h6",
            "text": "Visa"
          },
          {
            "tag": "h6",
            "text": "Reka: Best Use of Reka"
          },
          {
            "tag": "h6",
            "text": "Conversion: Best Use of Conversion"
          },
          {
            "tag": "h6",
            "text": "Conway: Most Data-Intensive Application"
          },
          {
            "tag": "h6",
            "text": "Lava: Best Use of Lava Gateway"
          },
          {
            "tag": "h6",
            "text": "Composio: Best Use of Composio Toolrouter"
          },
          {
            "tag": "h6",
            "text": "Crater: Play-Do Prize"
          },
          {
            "tag": "h6",
            "text": "Promise: Public Impact Prize (sponsored by Promise)"
          },
          {
            "tag": "h6",
            "text": "A37: Best Use of A37"
          },
          {
            "tag": "h6",
            "text": "SnapDev"
          },
          {
            "tag": "h6",
            "text": "Snap: Best Use of Snap Spectacles"
          },
          {
            "tag": "h6",
            "text": "Ripple: Best Use of XRP Ledger"
          },
          {
            "tag": "h6",
            "text": "Regeneron"
          },
          {
            "tag": "h6",
            "text": "Groq: Best Use of Groq"
          },
          {
            "tag": "h6",
            "text": "Ethereum Foundation: Best App Built on Ethereum, or an Ethereum L2"
          },
          {
            "tag": "h6",
            "text": "Interaction Company: Best MCP Automation"
          },
          {
            "tag": "h6",
            "text": "Letta: Build Your First Stateful AI Agent with Letta Cloud"
          },
          {
            "tag": "h6",
            "text": "JanitorAI: Most Functional, Novel, and Fun Project"
          },
          {
            "tag": "h6",
            "text": "fish.audio: Best use of Fish Audio"
          },
          {
            "tag": "h6",
            "text": "Chroma: Best AI application using Chroma"
          },
          {
            "tag": "h6",
            "text": "Most Wacky Hack (presented by Wordware)"
          },
          {
            "tag": "h6",
            "text": "[MLH] Best Use of AI powered by Reach Capital"
          },
          {
            "tag": "h6",
            "text": "[MLH] Best .Tech Domain Name"
          },
          {
            "tag": "h6",
            "text": "[MLH] Best Use of Gemini API"
          },
          {
            "tag": "h6",
            "text": "[MLH] Best Use of Snowflake API"
          },
          {
            "tag": "h6",
            "text": "[MLH] Best Use of ElevenLabs"
          },
          {
            "tag": "h6",
            "text": "[MLH] Best Use of DigitalOcean Gradient™ AIOpt"
          },
          {
            "tag": "h3",
            "text": "Devpost Achievements"
          },
          {
            "tag": "h3",
            "text": "Judges"
          },
          {
            "tag": "h3",
            "text": "Judging Criteria"
          },
          {
            "tag": "h4",
            "text": "Devpost"
          },
          {
            "tag": "h4",
            "text": "Hackathons"
          },
          {
            "tag": "h4",
            "text": "Portfolio"
          },
          {
            "tag": "h4",
            "text": "Connect"
          }
        ],
        "links": [
          {
            "text": "",
            "href": "#"
          },
          {
            "text": "",
            "href": "https://devpost.com"
          },
          {
            "text": "",
            "href": "#"
          },
          {
            "text": "Log in",
            "href": "https://secure.devpost.com/users/login?ref=top-nav-login"
          },
          {
            "text": "Sign up",
            "href": "https://secure.devpost.com/users/register?ref_content=signup_global_nav&ref_feature=signup&ref_medium=button"
          },
          {
            "text": "Join a hackathon",
            "href": "#join-a-hackathon"
          },
          {
            "text": "Devpost\nParticipate in our public hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Projects",
            "href": "https://devpost.com/software"
          },
          {
            "text": "Devpost for Teams\nAccess your company's private hackathons",
            "href": "https://devpost.team"
          },
          {
            "text": "Login",
            "href": "https://devpost.team"
          },
          {
            "text": "Host a hackathon",
            "href": "#host-a-hackathon"
          },
          {
            "text": "Devpost\nGrow your developer ecosystem and promote your platform",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Host a public hackathon",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Devpost for Teams\nDrive innovation, collaboration, and retention within your organization",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "Host an internal hackathon",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "AI hackathons",
            "href": "https://info.devpost.com/product/ai-hackathons"
          },
          {
            "text": "Customer hackathons",
            "href": "https://info.devpost.com/product/customer-hackathons"
          },
          {
            "text": "Employee hackathons",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "Public hackathons",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Resources",
            "href": "#resources"
          },
          {
            "text": "Blog\n      \n\n        Insights into hackathon planning and participation",
            "href": "https://info.devpost.com/blog"
          },
          {
            "text": "Customer stories\n      \n\n        Inspiration from peers and other industry leaders",
            "href": "https://info.devpost.com/customer-stories"
          },
          {
            "text": "Planning guides\n      \n\n        Best practices for planning online and in-person hackathons",
            "href": "https://info.devpost.com/guides"
          },
          {
            "text": "Webinars & events\n      \n\n        Upcoming events and on-demand recordings",
            "href": "https://info.devpost.com/webinar-events"
          },
          {
            "text": "Help desk\n      \n\n        Common questions and support documentation",
            "href": "https://help.devpost.com/"
          },
          {
            "text": "",
            "href": "https://devpost.com"
          },
          {
            "text": "Join a hackathon",
            "href": "#"
          },
          {
            "text": "Devpost\nParticipate in our public hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Projects",
            "href": "https://devpost.com/software"
          },
          {
            "text": "Devpost for Teams\nAccess your company's private hackathons",
            "href": "https://devpost.team"
          },
          {
            "text": "Login",
            "href": "https://devpost.team"
          },
          {
            "text": "Host a hackathon",
            "href": "#"
          },
          {
            "text": "Devpost\nGrow your developer ecosystem and promote your platform",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Host a public hackathon",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Devpost for Teams\nDrive innovation, collaboration, and retention within your organization",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "Host an internal hackathon",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "AI hackathons",
            "href": "https://info.devpost.com/product/ai-hackathons"
          },
          {
            "text": "Customer hackathons",
            "href": "https://info.devpost.com/product/customer-hackathons"
          },
          {
            "text": "Employee hackathons",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "Public hackathons",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Resources",
            "href": "#"
          },
          {
            "text": "Blog\n      \n\n        Insights into hackathon planning and participation",
            "href": "https://info.devpost.com/blog"
          },
          {
            "text": "Customer stories\n      \n\n        Inspiration from peers and other industry leaders",
            "href": "https://info.devpost.com/customer-stories"
          },
          {
            "text": "Planning guides\n      \n\n        Best practices for planning online and in-person hackathons",
            "href": "https://info.devpost.com/guides"
          },
          {
            "text": "Webinars & events\n      \n\n        Upcoming events and on-demand recordings",
            "href": "https://info.devpost.com/webinar-events"
          },
          {
            "text": "Help desk\n      \n\n        Common questions and support documentation",
            "href": "https://help.devpost.com/"
          },
          {
            "text": "",
            "href": "#"
          },
          {
            "text": "Log in",
            "href": "https://secure.devpost.com/users/login?ref=top-nav-login"
          },
          {
            "text": "Sign up",
            "href": "https://secure.devpost.com/users/register?ref_content=signup_global_nav&ref_feature=signup&ref_medium=button"
          },
          {
            "text": "Cal Hacks 12.0",
            "href": "https://cal-hacks-12-0.devpost.com/"
          },
          {
            "text": "Join hackathon",
            "href": "https://cal-hacks-12-0.devpost.com/register?flow%5Bdata%5D%5Bchallenge_id%5D=26945&flow%5Bname%5D=register_for_challenge"
          },
          {
            "text": "",
            "href": "https://cal-hacks-12-0.devpost.com/"
          },
          {
            "text": "Descend",
            "href": "#"
          },
          {
            "text": "Overview",
            "href": "https://cal-hacks-12-0.devpost.com/"
          },
          {
            "text": "My projects",
            "href": "https://devpost.com/submit-to/26945-cal-hacks-12-0/manage/submissions"
          },
          {
            "text": "Participants (612)",
            "href": "https://cal-hacks-12-0.devpost.com/participants"
          },
          {
            "text": "Resources",
            "href": "https://cal-hacks-12-0.devpost.com/resources"
          },
          {
            "text": "Rules",
            "href": "https://cal-hacks-12-0.devpost.com/rules"
          },
          {
            "text": "Project gallery",
            "href": "https://cal-hacks-12-0.devpost.com/project-gallery"
          },
          {
            "text": "Updates",
            "href": "https://cal-hacks-12-0.devpost.com/updates"
          },
          {
            "text": "Discussions",
            "href": "https://cal-hacks-12-0.devpost.com/forum_topics"
          },
          {
            "text": "Join hackathon",
            "href": "https://cal-hacks-12-0.devpost.com/register?flow%5Bdata%5D%5Bchallenge_id%5D=26945&flow%5Bname%5D=register_for_challenge"
          },
          {
            "text": "View full rules",
            "href": "/rules"
          },
          {
            "text": "View schedule",
            "href": "https://cal-hacks-12-0.devpost.com/details/dates"
          },
          {
            "text": "Apple",
            "href": "https://cal-hacks-12-0.devpost.com/calendar"
          },
          {
            "text": "Google",
            "href": "https://cal-hacks-12-0.devpost.com/calendar/google"
          },
          {
            "text": "Outlook",
            "href": "https://cal-hacks-12-0.devpost.com/calendar/outlook"
          },
          {
            "text": "Palace of Fine Arts",
            "href": "https://maps.google.com/?q=3601 Lyon St, San Francisco, CA 94123, USA"
          },
          {
            "text": "$52,650 in cash",
            "href": "#prizes"
          },
          {
            "text": "Cal Hacks",
            "href": "https://devpost.com/hackathons?organization=Cal+Hacks"
          },
          {
            "text": "Beginner Friendly",
            "href": "https://devpost.com/hackathons?themes%5B%5D=Beginner+Friendly"
          },
          {
            "text": "Machine Learning/AI",
            "href": "https://devpost.com/hackathons?themes%5B%5D=Machine+Learning%2FAI"
          },
          {
            "text": "Open Ended",
            "href": "https://devpost.com/hackathons?themes%5B%5D=Open+Ended"
          },
          {
            "text": "live.calhacks.io",
            "href": "https://live.calhacks.io/"
          },
          {
            "text": "calhacks.io/slack",
            "href": "https://calhacks.io/slack"
          },
          {
            "text": "https://docs.google.com/document/d/1k1J3HrCThfZyI2PdwgSOwGpT0Vt8Wv_QPhexhhZSatE/edit?tab=t.0#heading=h.gfqe3qx68hy5",
            "href": "https://docs.google.com/document/d/1k1J3HrCThfZyI2PdwgSOwGpT0Vt8Wv_QPhexhhZSatE/edit?tab=t.0#heading=h.gfqe3qx68hy5"
          },
          {
            "text": "https://docs.google.com/document/d/1i2wu_Z6Hb-WDyzM1woYFpqtfyp1Y-0Gc135XvK5fC8g/edit?tab=t.0#heading=h.pzdwayb1o6cg",
            "href": "https://docs.google.com/document/d/1i2wu_Z6Hb-WDyzM1woYFpqtfyp1Y-0Gc135XvK5fC8g/edit?tab=t.0#heading=h.pzdwayb1o6cg"
          },
          {
            "text": "https://regn.link/Calhacks",
            "href": "https://regn.link/Calhacks"
          },
          {
            "text": "https://discord.gg/letta",
            "href": "https://discord.gg/letta"
          },
          {
            "text": "Email the hackathon manager",
            "href": "mailto:team@hackberkeley.org"
          },
          {
            "text": "Privacy Policy",
            "href": "https://policies.google.com/privacy"
          },
          {
            "text": "Terms of Service",
            "href": "https://policies.google.com/terms"
          },
          {
            "text": "About",
            "href": "https://info.devpost.com/about"
          },
          {
            "text": "Careers",
            "href": "https://info.devpost.com/careers"
          },
          {
            "text": "Contact",
            "href": "https://info.devpost.com/contact"
          },
          {
            "text": "Help",
            "href": "https://help.devpost.com/"
          },
          {
            "text": "Browse hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Explore projects",
            "href": "https://devpost.com/software"
          },
          {
            "text": "Host a hackathon",
            "href": "https://info.devpost.com"
          },
          {
            "text": "Hackathon guides",
            "href": "https://info.devpost.com/guides"
          },
          {
            "text": "Your projects",
            "href": "https://devpost.com/portfolio/redirect?page=projects"
          },
          {
            "text": "Your hackathons",
            "href": "https://devpost.com/portfolio/redirect?page=hackathons"
          },
          {
            "text": "Settings",
            "href": "https://devpost.com/settings"
          },
          {
            "text": "Twitter",
            "href": "https://twitter.com/devpost"
          },
          {
            "text": "Discord",
            "href": "https://discord.com/invite/HP4BhW3hnp"
          },
          {
            "text": "Facebook",
            "href": "https://www.facebook.com/devposthacks"
          },
          {
            "text": "LinkedIn",
            "href": "https://www.linkedin.com/company/devpost/"
          },
          {
            "text": "Community guidelines",
            "href": "https://info.devpost.com/legal/community-guidelines"
          },
          {
            "text": "Security",
            "href": "https://info.devpost.com/legal/security"
          },
          {
            "text": "CA notice",
            "href": "https://info.devpost.com/legal/california-consumer-privacy-act"
          },
          {
            "text": "Privacy policy",
            "href": "https://info.devpost.com/legal/privacy-policy"
          },
          {
            "text": "Terms of service",
            "href": "https://info.devpost.com/legal/terms-of-service"
          }
        ],
        "text_content": "Cal Hacks 12.0: This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas. - Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up Cal Hacks 12.0 Deadline: Oct 26, 2025 @ 9:30am PDT Join hackathon Descend Overview My projects Participants (612) Resources Rules Project gallery Updates Discussions Cal Hacks 12.0 This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas. Join hackathon Who can participate Ages 18+ only College students only Team required All countries/territories, excluding standard exceptions View full rules October 26 at 12:30pm EDT to deadline View schedule Deadline: Oct 26, 2025 @ 9:30am PDT Apple Google Outlook Palace of Fine Arts Public $52,650 in cash 612 participants Cal Hacks Beginner Friendly Machine Learning/AI Open Ended Welcome to Cal Hacks 12.0! We're so excited to have you join us at the Palace of Fine Arts for the world's largest collegiate hackathon. Here are some resources to help you this weekend: Live Site: live.calhacks.io The Slack: calhacks.io/slack We really hope you enjoy the weekend! Chat to any organizer (beige shirts) if you need anything or use the #ask-directors channel on Slack. And, don't forget, go bears! Requirements Submit your hack by 10/26 9:30 AM PDT and make sure to add your teammates! You'll have until 10:30 AM to continue hacking and editing your submission (except for the table number), but the project must be submitted by 9:30 AM. Include an image of your project and GitHub repository for any code to be considered. Include the table number you're presenting from. This cannot change after 10/26 9:30 AM PST. All work must be done during the hackathon You will have two minutes to pitch and two minutes for judges to ask questions of you. You must have a recorded video submission stored locally with a demonstration. Hackathon Sponsors Prizes $52,650+ in prizes + other prizes Cal Hacks: 1st Overall 1 winner Macbook Air or Framework Laptop (13”) Cal Hacks: 2nd Overall 1 winner Meta Ray Bans Cal Hacks: 3rd Overall 1 winner Nintendo Switch Lites Cal Hacks: Best Hardware Hack 1 winner 3D Printers Cal Hacks: Hacker's Choice 1 winner Apple Airpods Cal Hacks: Most Creative Hack 1 winner iPad + Apple Pencil Cal Hacks: Greatest Social Impact 1 winner Apple Watches Cal Hacks: Best Beginner Hack 1 winner FujiFilm Polaroid Camera + Film Claude: Best Use of Claude 1 winner Tungsten Cube + $5000 API Credits. Technical Complexity – Showcases advanced implementation, creative problem-solving, or innovative use of Claude Code beyond basic features. Creative Use Case – Applies Claude Code in unexpected or novel ways that extend beyond standard dev workflows. Impact & Practicality – Tackles real-world problems with clear potential for meaningful, lasting impact. Amazon 1 winner To be announced! AppLovin: Query Planner Challenge $10,000 in cash 1 winner Follow this criteria: https://docs.google.com/document/d/1k1J3HrCThfZyI2PdwgSOwGpT0Vt8Wv_QPhexhhZSatE/edit?tab=t.0#heading=h.gfqe3qx68hy5 AppLovin: Ad Intelligence Challenge $3,000 in cash 1 winner Follow this criteria: https://docs.google.com/document/d/1i2wu_Z6Hb-WDyzM1woYFpqtfyp1Y-0Gc135XvK5fC8g/edit?tab=t.0#heading=h.pzdwayb1o6cg Fetch AI: Best Use of Fetch AI $2,500 in cash 1 winner $2500 + Internship Interview Opportunity Functionality & Technical Implementation (25%) – Works as intended; agents communicate and reason effectively in real time. Use of Fetch.ai Technology (20%) – Agents registered on Agentverse and integrated with the Chat Protocol for ASI:One discoverability. Innovation & Creativity (20%) – Original, inventive solution tackling problems in new or unconventional ways. Real-World Impact & Usefulness (20%) – Solves meaningful problems with clear value for end users. User Experience & Presentation (15%) – Clear demo, smooth UX, and well-structured presentation. Fetch AI: Best Deployment of Agentverse $1,500 in cash 1 winner $1500 + Internship Interview Opportunity Functionality & Technical Implementation (25%) – Works as intended; agents communicate and reason effectively in real time. Use of Fetch.ai Technology (20%) – Agents registered on Agentverse and integrated with the Chat Protocol for ASI:One discoverability. Innovation & Creativity (20%) – Original, inventive solution tackling problems in new or unconventional ways. Real-World Impact & Usefulness (20%) – Solves meaningful problems with clear value for end users. User Experience & Presentation (15%) – Clear demo, smooth UX, and well-structured presentation. Fetch AI: Best Use of ASI:One $1,000 in cash 1 winner $1000 + Internship Interview Opportunity Functionality & Technical Implementation (25%) – Works as intended; agents communicate and reason effectively in real time. Use of Fetch.ai Technology (20%) – Agents registered on Agentverse and integrated with the Chat Protocol for ASI:One discoverability. Innovation & Creativity (20%) – Original, inventive solution tackling problems in new or unconventional ways. Real-World Impact & Usefulness (20%) – Solves meaningful problems with clear value for end users. User Experience & Presentation (15%) – Clear demo, smooth UX, and well-structured presentation. Y Combinator: Build an Iconic YC Company 3 winners 1st place has a guaranteed interview with a YC partner. 2nd and 3rd place have guaranteed office hours and special swag. Postman 1 winner To be announced! Creao: Best Use of Creao $4,000 in cash 1 winner Projects must include at least one custom registered API on the Creao platform and demonstrate a working system with a short demo or explanation. Each project may enter only one Creao prize track. Judging (100 pts total): Impact (30 pts): Significance of the problem solved Creativity & Innovation (25 pts): Originality and inventive API use Technical Execution (25 pts): Functionality, integration, and smoothness Scalability (10 pts): Potential to expand beyond the hackathon Presentation (10 pts): Clarity and demo quality Ties will be decided by Impact. Teams must submit a brief form with project details and selected prize category. Warp: Best Use of Warp 1 winner Airpods for winners! Prizes will be judged on Innovation, Technicals, Presentation Vapi: Best Use of Vapi 1 winner The winner will win special swag and Vapi credits. Judges will vote on the best use of Voice AI in a project that uses Vapi. Elastic: Best use of the Elastic Agent Builder on a Serverless instance $3,000 in cash 2 winners 1st place: $2000, 2nd place: $1000. Qualified projects must: 1) Ingest and store data within Elastic 2) Using Agent Builder, register custom tools (Queries, actions) 3) Expose custom tools using MCP CodeRabbit: Best Use of CodeRabbit AI 1 winner Rey-Ban Meta AI Glasses Judging Criteria: Innovation (30%) – Creative use of CodeRabbit’s AI to enhance development. Technical Implementation (30%) – Quality of CodeRabbit integration in workflow. Impact (25%) – Improvement to productivity, collaboration, or code quality. Presentation (15%) – Clear demo, explanation, and results. Sui: Best Use of Sui 1 winner Water bottles, T-shirts, and cash prizes Rox: Best Use of Rox 1 winner Cash prize, value to be announced! LiveKit: Most Complex / Technically Challenging 1 winner Interviews for the engineering team at LiveKit Most Complex / Technically Challenging – Advanced use of LiveKit’s Agents framework or other SDKs. LiveKit: Most Creative Project 1 winner Apple Airpod Pro with engraved case Most Creative Project – Unique or unexpected application of LiveKit, voice, or video agents. LiveKit: Best Start-up Idea 1 winner Jetson Orin Nano Super Developer Kit 3 Best Startup Idea – Strong market potential, clear value, and monetization viability. The Bright Data: Best Use of Bright Data 3 winners 1st Prize: $1,500 Bright Data credits, $500 Amazon gift card 2nd Prize: $1,000 Bright Data credits, $300 Amazon gift card 3rd Prize: $500 Bright Data credits, $150 Amazon gift card Visa $200 in cash 1 winner $200 in Gift cards Reka: Best Use of Reka 1 winner Reka Credits and recognition as a showcased project on Reka’s website Conversion: Best Use of Conversion 1 winner Vespa Scooter (or cash equivalent) Projects must incorporate workflows, ideally using Temporal, and include a workflow builder as part of the application. Judging Criteria: Entries will be evaluated based on technical acumen and creativity. Conway: Most Data-Intensive Application 1 winner 4 WHOOP watches Data-Intensive Applications We’re looking for projects that process large volumes of data with significant computation per record — such as transactions, sensor readings, or user interactions — while performing complex operations like pattern matching, aggregation, or model inference. Lava: Best Use of Lava Gateway $4,000 in cash 3 winners 1st place: $2.5K cash 2nd place: $1K cash 3rd place: $500 cash Hackers looking to participate in the Lava Tech Prize only need to ensure that they incorporate Lava Gateway when they're building their project. Bonus points, but not necessary, if they also set up an initial pricing configuration with Lava. After meeting the initial criteria, hackers will be judged on the quality, functionality, creativity, and business viability of their projects. Composio: Best Use of Composio Toolrouter 1 winner $4K in Composio Credits Judging Criteria: Creativity – Originality of the problem statement and the proposed solution. Usefulness – Practical value and relevance to a clear customer segment. Integration Depth – Extensive use of Composio Toolrouter to connect and orchestrate multiple applications. Crater: Play-Do Prize 1 winner Awarded to the hack with the most composable, iterative, and playful design — spanning software, hardware, or deep tech. We’re looking for creativity, elasticity, and usefulness in products or features that build on themselves or adapt in unexpected ways, making users say, “Wow, how did they do that?” Prize: Winner’s choice of: 4× Meta Ray-Ban Display & Neural Band (pre-ordered and paid for by Crater), or “Hack for the Cow” — Crater buys a cow outright from our partner dairy farm, providing lifetime room and board, annual milk shipments, and fractional ownership among the team. Promise: Public Impact Prize (sponsored by Promise) 1 winner Exclusive Dinner in Berkeley with Leaders from YCombinator, Palantir, Google, and the White House + fast track interview with Promise's CTO. Criteria: Impact on Underserved Communities – addresses real world problems impacting low-income, at-risk, or otherwise marginalized individuals or communities. AI for Accessibility – use of communication AI (voice, chat, etc.) to drive down barrier of entry. Innovation – creative, forward-thinking application of technology. Usefulness and Pragmatism -- solutions demonstrates understanding the problem and thoughtfulness on real-world viability. A37: Best Use of A37 1 winner Nuphy Field75 HEs ($150/person) and runner ups will receive $50/person Main components to judge: system design, implementation, innovation, impact, presentation System design (30 points) - Clarity (10): Is the overall architecture easy to understand (diagram + explanation)? - Modularity (10): Did they design cleanly - modular services, good separation of concerns, minimal “hackiness”? - Scalability (10): Could this design handle increased load or additional users with minimal redesign? Implementation & Usage (25 pts) - Execution (10): Did they actually spin up infrastructure (e.g., Docker, cloud services, Kubernetes, Terraform, etc.)? - Automation (10): Did they automate setup or deployment (scripts, IaC, pipelines, containers)? - Reproducibility (5): Can others run it easily (README, clear setup, demo)? Innovation (20 pts) - Originality (10): Did they use infrastructure in a clever or unexpected way? - Problem-Solving (10): Did they engineer around limits (cost, APIs, permissions, time) in a smart way? Impact (15 pts) - Utility (10): Does it address a real infrastructure challenge (deployments, monitoring, scaling, DevOps pain points)? - Applicability (5): Could their approach reasonably be extended or integrated in a real-world system? Presentation (10 pts) - Explanation (5): Can the team clearly articulate their architecture and tradeoffs? - Comprehension (5): Do they show genuine understanding of the infra concepts they used? SnapDev 1 winner Nintendo Switches All finalists must have a live product 1/ Innovation and Creativity (25%) 2/ Impact and usefulness (25%) 3/ User experience (25%) 4/ Communication and presentation (25%) Snap: Best Use of Snap Spectacles 1 winner 1st place: Spectacles for each winning team member 2nd place: Nintendo Switch (1st gen) for each winning team member 3rd place: Soundview speakers for each winning team member Judging criteria is (1) technical implementation (2) innovation & creativity (3) Functionality & features (4) Impact & social relevance (5) user experience (6) visual & aesthetic quality Ripple: Best Use of XRP Ledger $1,000 in cash 3 winners $1,000 (1st), $500 (2nd); $250 for best developer feedback XRPL Track — Build an MVP Create a working MVP using the XRP Ledger to solve a real-world financial problem. Suggested areas: payments, RLUSD apps, RWA tokenization, or decentralized identity (DID). Features we’re looking for: RLUSD-based apps or SDKs DID-integrated fintech identity flows Developer SDKs exposing XRPL features (escrows, tokens, RLUSD) Payment apps, microfinance, or RWA tokenization Requirements & Awards: MVP must be public on GitHub with a detailed README Show how XRPL can drive real DeFi innovation! Regeneron $8,000 in cash 1 winner Regeneron CalHacks prize rubric & criteria will be at https://regn.link/Calhacks Groq: Best Use of Groq 1 winner $100 in Groq Credit, lego McClarens for each member Ethereum Foundation: Best App Built on Ethereum, or an Ethereum L2 1 winner Mainnet ETH for top hackers 1. Technical Implementation – Depth, originality, and quality of the build; effective use of Ethereum/L2 (contracts, SDKs, infrastructure); code quality, scalability, and security. 2. Relevance to Ethereum (25%) – Meaningful use of Ethereum features (smart contracts, composability, on-chain logic); adherence to Ethereum principles; preference for projects only possible on Ethereum. 3. Innovation & Creativity – Novel ideas or approaches; use of emerging primitives (account abstraction, intents, ERC standards, restaking, AI agents, etc.). 4. User Experience & Design – Clear, simple interface; design that complements technical features. 5. Impact & Potential – Potential to grow into a sustainable product or contribution; addresses real-world or Ethereum ecosystem needs; clearly communicates significance. Interaction Company: Best MCP Automation 1 winner Meta Ray-Bans + Apple AirPods Pro 3 + Interaction × The North Face jackets Most technically impressive automation judged on technical complexity, e.g. elaborate MCP connections, API integrations, novel use of MCP, etc. Letta: Build Your First Stateful AI Agent with Letta Cloud 1 winner AirPods + Letta Swag, Letta Swag for runner-ups Eligibility: Must use Letta Cloud or self-hosted Letta as a core component. Demonstrate stateful agent behavior with meaningful persistent memory. Include a demo showing memory and learning capabilities. Judging Criteria: Creative Use of Memory (35%) – Novel use of Letta’s memory architecture; thoughtful memory blocks; agent learns or adapts over time. Technical Implementation (25%) – Well-executed Letta integration; effective use of features (tools, memory blocks, multi-step reasoning); clean code and architecture. Impact & Usefulness (25%) – Solves a real problem; improves UX through statefulness; people would want to use it. Demo & Presentation (15%) – Demo clearly shows memory in action; persistence across sessions; clear value proposition. Example projects: personal assistants, adaptive tutors, research agents, context-aware support agents, or creative memory-driven applications. Avoid: stateless chatbots, API-only wrappers, or projects that don’t demonstrate meaningful memory. Bonus points: advanced Letta features, creative memory block design, and unique use cases. Resources: workshop, sponsor booth, docs.letta.com, Discord: https://discord.gg/letta JanitorAI: Most Functional, Novel, and Fun Project 1 winner 1 AirPods Max for each team member Projects will be judged for functionality, novelty, and \"fun\". fish.audio: Best use of Fish Audio $250 in cash 1 winner $250 cash per team member, $250 fish audio API credit per team member Technical novelty - is the project technically impressive? Creativity - is the idea creative and novel? Broader Impact - does this project have broad real world impacts? Use of Fish Audio API - does the project use Fish Audio API? Chroma: Best AI application using Chroma $200 in cash 1 winner Most Wacky Hack (presented by Wordware) $1,000 in cash 1 winner $1,000 in cash & $500 in Sauna credit Qualified projects must: 1) Ingest and store data within Elastic 2) Using Agent Builder, register custom tools (Queries, actions) 3) Expose custom tools using MCP [MLH] Best Use of AI powered by Reach Capital 1 winner Logitech Webcam & Meeting with the Reach Capital Investors AI has upended what we can accomplish with technology. Reach Capital invests in the next generation of founders and technical talent, and they want you to use AI to transform the future of learning, health, and work. Build a project that impacts one (or all!) of these areas for a chance to win a Logitech webcam for each member of your team and the exclusive opportunity to discuss your creation with Reach Capital’s team of expert investors. Interested in working at world-changing startups? Reach's 130+ portfolio companies — including Replit, Brilliant, ClassDojo, GPTZero, and Desmos — are always looking for the next wave of talent. Share what you’re studying, building, or exploring, and Reach will connect you to career-defining opportunities. Add your profile and join the hackers already in the Reach talent network. [MLH] Best .Tech Domain Name 1 winner Prize: Blue Snowball Microphone & a Free .Tech Domain Name for up to 10 years! What's in a name? Everything! Especially when it ends in .tech. This prize, brought to you by our partners at Major League Hacking (MLH), will go to the team with the most memorable and innovative .tech domain of the weekend. Winners get to take home a Blue Snowball Microphone and will get their .Tech Domain Name free for up to a decade! [MLH] Best Use of Gemini API 1 winner Prize: Mechanical Keyboards What will you build with the power of next-generation AI? In partnership with Major League Hacking (MLH), this prize is for the team that uses the Google Gemini API to create something truly jaw-dropping. Think bigger than just a chatbot—generate music, analyze scientific papers, or invent a tool that no one has thought of before. Show us the future of AI. The team with the most innovative AI-powered application will win new mechanical keyboards! [MLH] Best Use of Snowflake API 1 winner Arduino Tiny ML Kit Play with industry-leading LLMs on a single account using the Snowflake APIs. Adding AI capabilities into your application can be as simple as a single CURL command to Snowflake’s REST API. Build customized applications, RAG powered chat bots, or embed AI-powered features into your app in half the time with half the hassle. Get started for free with a special, student 120-day Snowflake trial and check out this repository for an example of the Snowflake REST API in action. [MLH] Best Use of ElevenLabs 1 winner Prize: ElevenLabs Apple Airpods 4 Make your project speak for itself! With ElevenLabs' powerful generative voice AI, you can bring your hack to life with realistic, expressive audio. In partnership with Major League Hacking (MLH), we're challenging you to find the most creative or compelling use of their API. From dynamic storytelling to creating interactive user assistants, the possibilities are endless. The winning team will win a set of ElevenLabs branded Airpods! [MLH] Best Use of DigitalOcean Gradient™ AIOpt 1 winner Prize: 8BitDo Retro Mouse DigitalOcean Gradient™ AI is a unified AI cloud for building, training, and deploying machine learning models and AI agents. Get access to GPU infrastructure like DigitalOcean GPU Droplets and Bare Metal servers, along with serverless inference and 1-Click Models for instant deployment of your favorite LLMs!! Sign up for DigitalOcean today and get $200 worth of free credits that you can use towards building your next Gradient-powered hack. Enable your next project with DigitalOcean GradientTM AI for a chance to win some great prizes for you and each of your team mates! Devpost Achievements Submitting to this hackathon could earn you: Judges Ddoski & his not-so judgy buddies. Cal Hacks 12.0 Judging Criteria Application Does the project have any feasible application in real life? Does it seem like something that someone could use or would actually have a benefit in the real world? Functionality/Quality Is the project free of major bugs? Does it look appealing? The UI/UX doesn’t have to be absolutely perfect, but if we're having a hard time understanding the project by looking at it, there may be a problem. Creativity Is this project unique and innovative? Is it a solution to a problem we have never seen before? A better way of doing something? Technical Complexity The team should display a good level of knowledge in terms of the technology they’ve used in implementing their project. Questions? Email the hackathon manager Invite others to compete This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service",
        "images": [
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost logo"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
            "alt": "Devpost for Teams"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
            "alt": "Devpost for Teams logo"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost logo"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
            "alt": "Devpost for Teams"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
            "alt": "Devpost for Teams logo"
          },
          {
            "src": "https://d112y698adiu2z.cloudfront.net/photos/production/challenge_photos/003/868/395/datas/full_width.png",
            "alt": "Cal Hacks 12.0"
          },
          {
            "src": "//d112y698adiu2z.cloudfront.net/photos/production/judge_photos/003/838/000/datas/large.png",
            "alt": "Ddoski & his not-so judgy buddies."
          }
        ],
        "tables": [
          [
            [
              "Palace of Fine Arts",
              "Public"
            ],
            [
              "$52,650 in cash",
              "612\n            participants"
            ]
          ]
        ],
        "forms": [
          {
            "action": "https://devpost.com/hackathons",
            "method": "get",
            "inputs": [
              {
                "type": "hidden",
                "name": "utf8",
                "placeholder": "",
                "value": "✓"
              },
              {
                "type": "search",
                "name": "search",
                "placeholder": "Search hackathons...",
                "value": ""
              }
            ]
          },
          {
            "action": "https://devpost.com/hackathons",
            "method": "get",
            "inputs": [
              {
                "type": "hidden",
                "name": "utf8",
                "placeholder": "",
                "value": "✓"
              },
              {
                "type": "search",
                "name": "search",
                "placeholder": "Search hackathons...",
                "value": ""
              }
            ]
          }
        ]
      }
    },
    "rules": {
      "text": "Cal Hacks 12.0: This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas. - Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up Cal Hacks 12.0 Deadline: Oct 26, 2025 @ 9:30am PDT Join hackathon Descend Overview My projects Participants (612) Resources Rules Project gallery Updates Discussions Everyone participating in the Cal Hacks community—including, but not limited to the hackathon and Slack channel—is required to agree to the following Code of Conduct. This includes all attendees, speakers, performers, patrons (sponsors), volunteers, and staff. Cal Hacks is dedicated to providing a harassment-free experience for everyone, regardless of gender, gender identity and expression, sexual orientation, disability, mental illness, neurotype, physical appearance, body, age, race, ethnicity, nationality, language, or religion. We do not tolerate harassment of participants in any form. Anyone who violates this Code of Conduct may be sanctioned or expelled from these spaces at the discretion of the Cal Hacks organizers. Cal Hacks prioritizes marginalized people’s safety over privileged people’s comfort. If a participant engages in harassing behavior, Cal Hacks may take any action we deem appropriate, up to and including expulsion from all Cal Hacks spaces and identification of the participant as a harasser to other Cal Hacks community members or the general public. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service",
      "structured": {
        "title": "Cal Hacks 12.0: This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas. - Devpost",
        "headings": [
          {
            "tag": "h3",
            "text": "Cal Hacks 12.0"
          },
          {
            "tag": "h1",
            "text": ""
          },
          {
            "tag": "h4",
            "text": "Devpost"
          },
          {
            "tag": "h4",
            "text": "Hackathons"
          },
          {
            "tag": "h4",
            "text": "Portfolio"
          },
          {
            "tag": "h4",
            "text": "Connect"
          }
        ],
        "links": [
          {
            "text": "",
            "href": "#"
          },
          {
            "text": "",
            "href": "https://devpost.com"
          },
          {
            "text": "",
            "href": "#"
          },
          {
            "text": "Log in",
            "href": "https://secure.devpost.com/users/login?ref=top-nav-login"
          },
          {
            "text": "Sign up",
            "href": "https://secure.devpost.com/users/register?ref_content=signup_global_nav&ref_feature=signup&ref_medium=button"
          },
          {
            "text": "Join a hackathon",
            "href": "#join-a-hackathon"
          },
          {
            "text": "Devpost\nParticipate in our public hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Projects",
            "href": "https://devpost.com/software"
          },
          {
            "text": "Devpost for Teams\nAccess your company's private hackathons",
            "href": "https://devpost.team"
          },
          {
            "text": "Login",
            "href": "https://devpost.team"
          },
          {
            "text": "Host a hackathon",
            "href": "#host-a-hackathon"
          },
          {
            "text": "Devpost\nGrow your developer ecosystem and promote your platform",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Host a public hackathon",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Devpost for Teams\nDrive innovation, collaboration, and retention within your organization",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "Host an internal hackathon",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "AI hackathons",
            "href": "https://info.devpost.com/product/ai-hackathons"
          },
          {
            "text": "Customer hackathons",
            "href": "https://info.devpost.com/product/customer-hackathons"
          },
          {
            "text": "Employee hackathons",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "Public hackathons",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Resources",
            "href": "#resources"
          },
          {
            "text": "Blog\n      \n\n        Insights into hackathon planning and participation",
            "href": "https://info.devpost.com/blog"
          },
          {
            "text": "Customer stories\n      \n\n        Inspiration from peers and other industry leaders",
            "href": "https://info.devpost.com/customer-stories"
          },
          {
            "text": "Planning guides\n      \n\n        Best practices for planning online and in-person hackathons",
            "href": "https://info.devpost.com/guides"
          },
          {
            "text": "Webinars & events\n      \n\n        Upcoming events and on-demand recordings",
            "href": "https://info.devpost.com/webinar-events"
          },
          {
            "text": "Help desk\n      \n\n        Common questions and support documentation",
            "href": "https://help.devpost.com/"
          },
          {
            "text": "",
            "href": "https://devpost.com"
          },
          {
            "text": "Join a hackathon",
            "href": "#"
          },
          {
            "text": "Devpost\nParticipate in our public hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Projects",
            "href": "https://devpost.com/software"
          },
          {
            "text": "Devpost for Teams\nAccess your company's private hackathons",
            "href": "https://devpost.team"
          },
          {
            "text": "Login",
            "href": "https://devpost.team"
          },
          {
            "text": "Host a hackathon",
            "href": "#"
          },
          {
            "text": "Devpost\nGrow your developer ecosystem and promote your platform",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Host a public hackathon",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Devpost for Teams\nDrive innovation, collaboration, and retention within your organization",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "Host an internal hackathon",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "AI hackathons",
            "href": "https://info.devpost.com/product/ai-hackathons"
          },
          {
            "text": "Customer hackathons",
            "href": "https://info.devpost.com/product/customer-hackathons"
          },
          {
            "text": "Employee hackathons",
            "href": "https://info.devpost.com/product/devpost-for-teams"
          },
          {
            "text": "Public hackathons",
            "href": "https://info.devpost.com/product/public-hackathons"
          },
          {
            "text": "Resources",
            "href": "#"
          },
          {
            "text": "Blog\n      \n\n        Insights into hackathon planning and participation",
            "href": "https://info.devpost.com/blog"
          },
          {
            "text": "Customer stories\n      \n\n        Inspiration from peers and other industry leaders",
            "href": "https://info.devpost.com/customer-stories"
          },
          {
            "text": "Planning guides\n      \n\n        Best practices for planning online and in-person hackathons",
            "href": "https://info.devpost.com/guides"
          },
          {
            "text": "Webinars & events\n      \n\n        Upcoming events and on-demand recordings",
            "href": "https://info.devpost.com/webinar-events"
          },
          {
            "text": "Help desk\n      \n\n        Common questions and support documentation",
            "href": "https://help.devpost.com/"
          },
          {
            "text": "",
            "href": "#"
          },
          {
            "text": "Log in",
            "href": "https://secure.devpost.com/users/login?ref=top-nav-login"
          },
          {
            "text": "Sign up",
            "href": "https://secure.devpost.com/users/register?ref_content=signup_global_nav&ref_feature=signup&ref_medium=button"
          },
          {
            "text": "Cal Hacks 12.0",
            "href": "https://cal-hacks-12-0.devpost.com/"
          },
          {
            "text": "Join hackathon",
            "href": "https://cal-hacks-12-0.devpost.com/register?flow%5Bdata%5D%5Bchallenge_id%5D=26945&flow%5Bname%5D=register_for_challenge"
          },
          {
            "text": "",
            "href": "https://cal-hacks-12-0.devpost.com/"
          },
          {
            "text": "Descend",
            "href": "#"
          },
          {
            "text": "Overview",
            "href": "https://cal-hacks-12-0.devpost.com/"
          },
          {
            "text": "My projects",
            "href": "https://devpost.com/submit-to/26945-cal-hacks-12-0/manage/submissions"
          },
          {
            "text": "Participants (612)",
            "href": "https://cal-hacks-12-0.devpost.com/participants"
          },
          {
            "text": "Resources",
            "href": "https://cal-hacks-12-0.devpost.com/resources"
          },
          {
            "text": "Rules",
            "href": "https://cal-hacks-12-0.devpost.com/rules"
          },
          {
            "text": "Project gallery",
            "href": "https://cal-hacks-12-0.devpost.com/project-gallery"
          },
          {
            "text": "Updates",
            "href": "https://cal-hacks-12-0.devpost.com/updates"
          },
          {
            "text": "Discussions",
            "href": "https://cal-hacks-12-0.devpost.com/forum_topics"
          },
          {
            "text": "About",
            "href": "https://info.devpost.com/about"
          },
          {
            "text": "Careers",
            "href": "https://info.devpost.com/careers"
          },
          {
            "text": "Contact",
            "href": "https://info.devpost.com/contact"
          },
          {
            "text": "Help",
            "href": "https://help.devpost.com/"
          },
          {
            "text": "Browse hackathons",
            "href": "https://devpost.com/hackathons"
          },
          {
            "text": "Explore projects",
            "href": "https://devpost.com/software"
          },
          {
            "text": "Host a hackathon",
            "href": "https://info.devpost.com"
          },
          {
            "text": "Hackathon guides",
            "href": "https://info.devpost.com/guides"
          },
          {
            "text": "Your projects",
            "href": "https://devpost.com/portfolio/redirect?page=projects"
          },
          {
            "text": "Your hackathons",
            "href": "https://devpost.com/portfolio/redirect?page=hackathons"
          },
          {
            "text": "Settings",
            "href": "https://devpost.com/settings"
          },
          {
            "text": "Twitter",
            "href": "https://twitter.com/devpost"
          },
          {
            "text": "Discord",
            "href": "https://discord.com/invite/HP4BhW3hnp"
          },
          {
            "text": "Facebook",
            "href": "https://www.facebook.com/devposthacks"
          },
          {
            "text": "LinkedIn",
            "href": "https://www.linkedin.com/company/devpost/"
          },
          {
            "text": "Community guidelines",
            "href": "https://info.devpost.com/legal/community-guidelines"
          },
          {
            "text": "Security",
            "href": "https://info.devpost.com/legal/security"
          },
          {
            "text": "CA notice",
            "href": "https://info.devpost.com/legal/california-consumer-privacy-act"
          },
          {
            "text": "Privacy policy",
            "href": "https://info.devpost.com/legal/privacy-policy"
          },
          {
            "text": "Terms of service",
            "href": "https://info.devpost.com/legal/terms-of-service"
          }
        ],
        "text_content": "Cal Hacks 12.0: This year's Cal Hacks is co-hosted by Claude, Fetch AI, AppLovin, and Amazon's Annapurna Labs! Together we'll assemble in SF for a weekend of hacking, friendship, and crazy ideas. - Devpost Log in Sign up Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Join a hackathon Devpost Participate in our public hackathons Hackathons Projects Devpost for Teams Access your company's private hackathons Login Host a hackathon Devpost Grow your developer ecosystem and promote your platform Host a public hackathon Devpost for Teams Drive innovation, collaboration, and retention within your organization Host an internal hackathon By use case AI hackathons Customer hackathons Employee hackathons Public hackathons Resources Blog Insights into hackathon planning and participation Customer stories Inspiration from peers and other industry leaders Planning guides Best practices for planning online and in-person hackathons Webinars & events Upcoming events and on-demand recordings Help desk Common questions and support documentation Log in Sign up Cal Hacks 12.0 Deadline: Oct 26, 2025 @ 9:30am PDT Join hackathon Descend Overview My projects Participants (612) Resources Rules Project gallery Updates Discussions Everyone participating in the Cal Hacks community—including, but not limited to the hackathon and Slack channel—is required to agree to the following Code of Conduct. This includes all attendees, speakers, performers, patrons (sponsors), volunteers, and staff. Cal Hacks is dedicated to providing a harassment-free experience for everyone, regardless of gender, gender identity and expression, sexual orientation, disability, mental illness, neurotype, physical appearance, body, age, race, ethnicity, nationality, language, or religion. We do not tolerate harassment of participants in any form. Anyone who violates this Code of Conduct may be sanctioned or expelled from these spaces at the discretion of the Cal Hacks organizers. Cal Hacks prioritizes marginalized people’s safety over privileged people’s comfort. If a participant engages in harassing behavior, Cal Hacks may take any action we deem appropriate, up to and including expulsion from all Cal Hacks spaces and identification of the participant as a harasser to other Cal Hacks community members or the general public. Devpost About Careers Contact Help Hackathons Browse hackathons Explore projects Host a hackathon Hackathon guides Portfolio Your projects Your hackathons Settings Connect Twitter Discord Facebook LinkedIn © 2025 Devpost, Inc. All rights reserved. Community guidelines Security CA notice Privacy policy Terms of service",
        "images": [
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost logo"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
            "alt": "Devpost for Teams"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
            "alt": "Devpost for Teams logo"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-25d0005ec83e3b9ef6fce93235bb6d642d7c828f31758ebdb5b7ee87de7d45c3.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost logo"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
            "alt": "Devpost for Teams"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/devpost-logo-mobile-f3aff76bfc0b6ada9bb4ddd773bfc534769ed793f962612804a1e84c305a5f94.svg",
            "alt": "Devpost"
          },
          {
            "src": "https://d2dmyh35ffsxbl.cloudfront.net/assets/reimagine2/dft-logo-mobile-ab66dd5a4f4b2f045ad86d0e5f432dc85974c3d778b353d32213c24ca176484b.svg",
            "alt": "Devpost for Teams logo"
          },
          {
            "src": "https://d112y698adiu2z.cloudfront.net/photos/production/challenge_photos/003/868/395/datas/full_width.png",
            "alt": "Cal Hacks 12.0"
          }
        ],
        "tables": [],
        "forms": [
          {
            "action": "https://devpost.com/hackathons",
            "method": "get",
            "inputs": [
              {
                "type": "hidden",
                "name": "utf8",
                "placeholder": "",
                "value": "✓"
              },
              {
                "type": "search",
                "name": "search",
                "placeholder": "Search hackathons...",
                "value": ""
              }
            ]
          },
          {
            "action": "https://devpost.com/hackathons",
            "method": "get",
            "inputs": [
              {
                "type": "hidden",
                "name": "utf8",
                "placeholder": "",
                "value": "✓"
              },
              {
                "type": "search",
                "name": "search",
                "placeholder": "Search hackathons...",
                "value": ""
              }
            ]
          }
        ]
      }
    }
  }
}